{
  "version": "https://jsonfeed.org/version/1.1",
  "title": "e-editiones",
  "language": "en",
  "home_page_url": "https://e-editiones.org/",
  "feed_url": "https://e-editiones.org/feed/feed.json",
  "description": "e-editiones – Society for Scholarly Digital Editions",
  "author": {
    "name": "",
    "url": ""
  },
  "items": [{
      "id": "https://e-editiones.org/posts/community-event-going-static/",
      "url": "https://e-editiones.org/posts/community-event-going-static/",
      "title": "Generating a high voltage site by going static",
      "content_html": "<p>Upcoming community meetup on <strong>Dec. 6, 2022</strong>:</p>\n<p>Sometimes you don't need a fully dynamic website with sophisticated search and navigation, but rather a simple service, which is super fast, reliable and easy to maintain. This is where static site generators provide a perfect alternative to a dynamic, database-driven architecture like TEI Publisher. In this session we'll learn how to marry the two concepts to combine the best of both worlds.</p>\n",
      "date_published": "2022-12-01T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/workshop-tei-christmas-2022/",
      "url": "https://e-editiones.org/posts/workshop-tei-christmas-2022/",
      "title": "Workshop on 30th Nov, 7th Dec and 14th Dec 2022 5-9pm CET",
      "content_html": "<p>We are offering a workshop entitled «Have yourself a TEI-Christmas» to be offered online via Zoom. The workshop will take place on three consecutive Wednesdays (Nov, 30; Dec 7 and 14) from 11:00-15:00 Eastern Standard Time/17:00-21:00 Central European Time.</p>\n<p>This introductory workshop offers the basic concepts and methods of creating a digital edition from start to finish and will offer an overview of XML/TEI standards and FAIR principles using the Oxygen XML Editor. The workshop will be taught using a hands-on-approach: we will provide materials for practice, but there will also be time for participants to work on their own projects with guidance from the workshop organizers. Using provided examples as well as their own texts, participants will learn the basics of project organization, XML scripting, and practical skills like integrating digital images into digital text editions. The primary audience of this workshop is those who are newcomers to the Digital Humanities and who would like to learn the essentials -as well as the possibilities and potential pitfalls - of bringing analog texts into a digital environment. No previous experience with coding or XML is assumed.</p>\n<p>For registration please mail us: <a href=\"mailto:info@e-editiones.org\">info@e-editiones.org</a></p>\n",
      "date_published": "2022-11-07T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/contributing-content/",
      "url": "https://e-editiones.org/posts/contributing-content/",
      "title": "Contributing Content to e-editiones",
      "content_html": "<blockquote>\n<p>The community is invited to contribute content in the form of tutorials, announcements, project reports, teaching materials – whatever may be of interest and help other members.</p>\n</blockquote>\n<p>The e-editiones website is hosted on GitHub and will be updated whenever files are pushed to the repository. Articles are authored using Markdown syntax and start with a short header to tell the system how the post should appear on the website. You don't need any special software to write a post: you can do it directly in the web browser using GitHub's simple editor (though we would recommend using a proper text editor for longer posts).</p>\n<h2 id=\"adding-an-article\" tabindex=\"-1\">Adding an article</h2>\n<p>To contribute an article, log into GitHub with your account (or create one first) and browse to the <a href=\"https://github.com/eeditiones/e-editiones-website/tree/main/posts\">posts</a> subfolder of the GitHub repository and click on the <code>Add file</code> button in the toolbar. Choose the <code>Create new file</code> option to write your text.</p>\n<figure><img src=\"https://e-editiones.org/img/contributing-content1.png\" alt=\"\" height=\"64px\" /><figcaption>Add file button</figcaption></figure>\n<p>Unless you are a member of the editorial team, GitHub will warn you that you are about to make changes to a project you don't have write access to. This is ok! Your changes will result in a <em>pull request</em>, which will be sent to the e-editiones team for approval.</p>\n<figure><img src=\"https://e-editiones.org/img/contributing-content2.png\" alt=\"\" /><figcaption>GitHub editor view</figcaption></figure>\n<h2 id=\"editing-the-article\" tabindex=\"-1\">Editing the article</h2>\n<p>As mentioned above, every article should start with a short header containing some basic metadata delimited by 3 dashes (<code>---</code>):</p>\n<pre class=\"language-yaml\"><code class=\"language-yaml\"><span class=\"token punctuation\">---</span><br /><span class=\"token key atrule\">title</span><span class=\"token punctuation\">:</span> Full title of the article<br /><span class=\"token key atrule\">short</span><span class=\"token punctuation\">:</span> (optional) Short title<br /><span class=\"token key atrule\">lead</span><span class=\"token punctuation\">:</span> (optional) Descriptive short summary<br /><span class=\"token key atrule\">author</span><span class=\"token punctuation\">:</span> Author of the article<br /><span class=\"token key atrule\">date</span><span class=\"token punctuation\">:</span> <span class=\"token datetime number\">2022-10-25</span><br /><span class=\"token key atrule\">tags</span><span class=\"token punctuation\">:</span><br />    <span class=\"token punctuation\">-</span> events<br />    <span class=\"token punctuation\">-</span> meetups<br /><span class=\"token key atrule\">coverImage</span><span class=\"token punctuation\">:</span> (recommended) Image to be used as cover<span class=\"token punctuation\">,</span> located in img folder<br /><span class=\"token key atrule\">coverImageCredits</span><span class=\"token punctuation\">:</span> (recommended) Any credits to be shown for the cover image<br /><span class=\"token punctuation\">---</span></code></pre>\n<p>You should at least provide the full title, author, date and some tags. You may also supply a short title if your main title is longer than ~5 words. The <em>short title</em> as well as the <em>lead</em> will be used in post listings (like the one on the start page).</p>\n<p>We also recommend to choose a cover image to catch some attention. Images have to be saved separately in the <a href=\"https://github.com/eeditiones/e-editiones-website/tree/main/img\">img</a> folder. This needs to be done by the editorial team as normal contributors are not allowed to upload via the web interface. However, you can drag and drop images into the text and the editors will later move it to the right place (see section on images below). Don't forget to provide proper credits in the <code>coverImageCredits</code> field.</p>\n<p>Every article should have one or two tags. Tags are important for navigation within the website. Please include at least one of the tag categories listed below. Tags shown as nested below should always come in pairs. For example, if you write about a conference, you should include the tags <code>events</code> <strong>and</strong> <code>conference</code>.</p>\n<ul>\n<li>events\n<ul>\n<li>workshop</li>\n<li>meetups</li>\n<li>conference</li>\n</ul>\n</li>\n<li>announcements\n<ul>\n<li>call</li>\n<li>e-editiones</li>\n<li>tei-publisher</li>\n<li>... other tags referring to a particular software package, working group etc.</li>\n</ul>\n</li>\n<li>tutorial\n<ul>\n<li>beginner</li>\n<li>intermediate</li>\n<li>advanced</li>\n</ul>\n</li>\n<li>faq</li>\n<li>report\n<ul>\n<li>projects</li>\n<li>best practice</li>\n</ul>\n</li>\n<li>teaching</li>\n</ul>\n<h2 id=\"writing-content\" tabindex=\"-1\">Writing content</h2>\n<p>Content is written using <a href=\"https://commonmark.org/help/\">markdown syntax</a>. It should not repeat the title already given in the header as this will be inserted automatically.</p>\n<p>If you write a longer article, please use headings to give it some structure. They will be automatically added to the table of contents in the right sidebar and help the user to navigate the text.</p>\n<h2 id=\"images\" tabindex=\"-1\">Images</h2>\n<p>You cannot upload images to the correct folder via the web interface, but you can drag and drop image files into the text editor and GitHub will generate a link. When reviewing the text, the editorial team will move the images into the correct place.</p>\n<h2 id=\"submitting\" tabindex=\"-1\">Submitting</h2>\n<p>Once you are happy with your article, fill out the form at the bottom of the GitHub page, titled <em>Propose new file</em>. Provide a title and maybe a short comment for the editorial team.</p>\n<figure><img src=\"https://e-editiones.org/img/contributing-content3.png\" alt=\"\" /><figcaption>Form to propose new file</figcaption></figure>\n<p>After clicking <em>Propose new file</em>, you will be presented with another form for creating a so-called <em>pull request</em>. Click on the green button: <em>Create pull request</em> to start sending the request.</p>\n<figure><img src=\"https://e-editiones.org/img/contributing-content4.png\" alt=\"\" /><figcaption>First screen for creating a pull request</figcaption></figure>\n<p>This will be followed by yet another form on which you could provide further notes concerning your contribution, but it's usually enough to just confirm once again by pressing the <em>Create pull request</em> button again.</p>\n<h2 id=\"for-experienced-users\" tabindex=\"-1\">For experienced users</h2>\n<p>Users familiar with git may prefer to fork the repository. This allows you to conveniently work on more than one text, use the editor of your choice or add images.</p>\n<p>To start a local server (on port 8081) with the website, change into the cloned directory, run <code>npm install</code> followed by <code>npm start</code>.</p>\n",
      "date_published": "2022-11-02T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/community-meeting-roaster/",
      "url": "https://e-editiones.org/posts/community-meeting-roaster/",
      "title": "What&#39;s that scent?",
      "content_html": "<p>Upcoming community meetup on Nov. 15, 2022:</p>\n<p>Juri Leino (eXistSolutions/Jinntec) will talk about recent developments in Roaster, the OpenApi implementation, which handles client-server communication in TEI Publisher. Learn about file uploads, mime-types, schemas and what is coming next.</p>\n<p><a href=\"https://e-editiones.org/assets/files/roaster-eeditiones-community-2022.pdf\">View the slides</a> from the talk.</p>\n",
      "date_published": "2022-11-02T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/past-meetings/",
      "url": "https://e-editiones.org/posts/past-meetings/",
      "title": "Past Community Meetings",
      "content_html": "<h3 id=\"past-meetings\" tabindex=\"-1\">Past Meetings</h3>\n<figure><img src=\"https://e-editiones.org/img/estee-janssens-zni0zgb3bkQ-unsplash.jpg\" alt=\"\" /></figure>\n<h4 id=\"2022\" tabindex=\"-1\">2022</h4>\n<h5 id=\"2022-07-18-register-of-older-slovenian-manuscripts\" tabindex=\"-1\">2022-07-18 Register of Older Slovenian Manuscripts</h5>\n<p>Matija Ogrin (Institute of Slovenian Literature and Literary Studies ZRC SAZU Ljubljana) and Magdalena Tuska (JinnTec GmbH)</p>\n<h5 id=\"2022-07-05-travelab%3A-a-multilingual-mapped-edition-of-benjamin-of-tudela's-travelog.\" tabindex=\"-1\">2022-07-05 <a href=\"https://teipublisher.info/exist/apps/TraveLab/index.html\">TraveLab</a>: a multilingual mapped edition of Benjamin of Tudela's travelog.</h5>\n<p>Dr. Sinai Rusinek, Elijah Lab (Haifa University) and OMILab (Open University), and Gil Shalit, independent developer, <a href=\"http://dh-dev.com/\">DH-Dev.com</a></p>\n<p>We will show different stages in the preparation of a multi-lingual travelog edition, from modelling, digitization, geo-referencing and alignment, through to the adaptation of TEI-Publisher to provide a meaningful interaction with the texts. We will look specifically at aligning three versions with each other and at extending the pb-leaflet-map’s functionality with Javascript hooks.</p>\n<p>We will also briefly demonstrate <a href=\"https://xmlplanter.dh-dev.com/\">XMLPlanter</a>, an open online tool we have developed to assist in preparing parallel editions.</p>\n<h5 id=\"2022-06-07-names-sell%3A-named-entity-recognition-in-tei-publisher\" tabindex=\"-1\">2022-06-07 Names sell: Named entity recognition in TEI Publisher</h5>\n<p>In this talk we'll learn how to enable the named entity recognition feature in the forthcoming TEI Publisher 8 to assist with semantic annotations. We'll also see how to train a custom recognition model from a set of already annotated documents, discuss the current (early) state of the feature and possible future developments (<a href=\"https://e-editiones.org/names-sell-named-entity-recognition-in-tei-publisher/\">transcript of the talk).</a></p>\n<h5 id=\"2022-05-03-cancelled\" tabindex=\"-1\">2022-05-03 Cancelled</h5>\n<h5 id=\"2022-04-12-anatomy-of-the-alfred-escher-edition%3A-remastering-a-sophisticated-project-to-tei-publisher\" tabindex=\"-1\">2022-04-12 Anatomy of the Alfred Escher Edition: Remastering a sophisticated project to TEI Publisher</h5>\n<p>The Alfred Escher correspondence represents a prominent edition, which has recently been ported to TEI Publisher to save it from shutting down. The goal was to preserve the existing functionality and site organization while reducing the long-term maintenance costs.</p>\n<p>In this talk we'll have a close look at how this task was undertaken and hope to provide some hints for others who may find themselves confronted with similar challenges. On the way we'll also meet some of the new features coming to Publisher 8.</p>\n<h5 id=\"2022-03-01-orchestrating-tei-publisher-and-fore-to-edit-and-publish-lgpn-ling\" tabindex=\"-1\">2022-03-01 Orchestrating TEI Publisher and Fore to edit and publish LGPN-Ling</h5>\n<p>Magdalena Turska</p>\n<p><em>LGPN-Ling: <em>Etymological and Semantic analysis of ancient Greek personal names</em></em> is a dictionary accompanying the Lexicon of Greek Personal Names. The purpose of <em>LGPN-Ling</em> is to elucidate the meaning of Greek names, a task which has never before been systematically undertaken and to provide an essential semantical complement to the LGPN Database.</p>\n<p>Technical scaffolding of the LGPN-Ling project comprises of:</p>\n<ul>\n<li>eXist database of TEI encoded documents,</li>\n<li>TEI Publisher-based application with an extended API to publish and query the  data,</li>\n<li>Fore XForms to edit the data.</li>\n</ul>\n<figure><img src=\"https://e-editiones.org/img/ling-1024x607.png\" alt=\"\" /></figure>\n<h5 id=\"2022-02-01-tutorial%3A-connecting-components-to-custom-api-endpoints\" tabindex=\"-1\">2022-02-01 Tutorial: Connecting components to custom API endpoints</h5>\n<p>Wolfgang Meier</p>\n<p>This will be a tutorial session demonstrating  a new component for displaying categorized lists, e.g. to browse through people or places and paginate the results by first letter of alphabet, country or other categories. We'll learn how to connect this component to the API by creating a custom endpoint.</p>\n<p>We'll also look at an enhanced version of the map component to display all places mentioned in an edition in a clustered view.</p>\n<figure><img src=\"https://e-editiones.org/img/Bildschirmfoto-2022-01-27-um-11.52.36.png\" alt=\"\" /></figure>\n<h4 id=\"2021\" tabindex=\"-1\">2021</h4>\n<h5 id=\"2021-12-07-combined-workflow-for-publishing-jurisprudentia-frisica\" tabindex=\"-1\">2021-12-07 Combined Workflow for Publishing Jurisprudentia Frisica</h5>\n<p>Eduard Drenth, Fryske Akademy</p>\n<p>Designing a robust workflow for editors working both in word and in teipublisher.</p>\n<h5 id=\"2021-10-05-an-introduction-to-the-distributed-text-services-(dts)\" tabindex=\"-1\">2021-10-05 An introduction to the Distributed Text Services (DTS)</h5>\n<p>Pietro Liuzzo, Universität Hamburg</p>\n<p>The Distributed Text Services (DTS) Specification defines an API for working with collections of text as machine-actionable data.</p>\n<p>More Information: <a href=\"https://distributed-text-services.github.io/specifications/\">https://distributed-text-services.github.io/specifications/</a></p>\n<p><a href=\"https://docs.google.com/presentation/d/1eFV9Pg9pVHdT6AEUQ9QKi2MZs4X3F53EL-AqJnoviMA/edit?usp=sharing\">Slides of the talk</a>.</p>\n<h5 id=\"2021-09-07%3A-tei-publisher-7.1---configuring-web-annotations\" tabindex=\"-1\">2021-09-07: TEI Publisher 7.1 - Configuring Web Annotations</h5>\n<p>In this session we'll have a closer look at the new web annotations editor in TEI Publisher 7.1. We'll learn how to create a custom annotation app and configure it to match the requirements of a specific edition, i.e. add new annotation types and modify the existing ones.</p>\n<h5 id=\"2021-07-06%3A-contributing-to-tei-publisher---a-gentle-introduction\" tabindex=\"-1\">2021-07-06: Contributing to TEI Publisher - A Gentle Introduction</h5>\n<p>Talk by Wolfgang Meier (eXist Solutions) on Tuesday, the 6th of July 2021 at 17:00 CEST.</p>\n<p>Open source projects like TEI Publisher depend on an active, contributing community. Many believe that you need to be a programmer to contribute, but this is a misconception! Documentation, communication, supporting users or providing feedback are at least as important for an open source project as thousands of lines of code.</p>\n<p>This session targets non-programmers as well as those with some development skills. We'll start with simple things, e.g. contributing to the <a href=\"https://faq.teipublisher.com/\" title=\"FAQ\">FAQ</a>, and then move on and show you how to create your own little web component to plug into TEI Publisher. We'll use a grid component for displaying tabular data as an example.</p>\n<h5 id=\"2021-06-15%3A-for(e)-humanists---metadata%2C-forms-and-more\" tabindex=\"-1\">2021-06-15: For(e) humanists - Metadata, Forms and more</h5>\n<p>Joern Turner, eXistSolutions and Jinntec GmbH</p>\n<p>Fore is a model-driven forms framework that follows the ideas of the XForms 2.0 Standard but translates those into the world of HTML5 Web Components.</p>\n<p>Many edition project require some sort of complex input form sooner or later - just think about collecting metadata for the TEI header. The talk will focus on TEI and show you how to author such forms in HTML5.</p>\n<p>Join the talk here: <a href=\"https://meet.existsolutions.com/eeditiones\">https://meet.existsolutions.com/eeditiones</a></p>\n<h5 id=\"2021-06-01%3A-faircopy\" tabindex=\"-1\">2021-06-01: FairCopy</h5>\n<p>Nick Laiacona, President Performant Software Solutions <a href=\"https://www.performantsoftware.com/\">https://www.performantsoftware.com</a></p>\n<p>FairCopy is a specialized word processor for studying manuscripts and historical texts. It gives scholars a desktop editing environment to create TEI encoded texts without writing XML code. In this demonstration, we will explore what sorts of editions you can build using FairCopy and how it can fit into a larger ecosystem of tools leveraging TEI XML.</p>\n<p>In addition, Wolfgang will give us a sneak preview of some exciting TEI Publisher 8 features under development.</p>\n<h5 id=\"2021-05-04%3A-open-access-scholarly-digital-editions-at-the-finnish-literature-society%3A-experiences-with-tei-publisher\" tabindex=\"-1\">2021-05-04: Open access scholarly digital editions at the Finnish Literature Society: experiences with TEI Publisher</h5>\n<p>Maria Niku, Tiedekustantamo, Suomalaisen Kirjallisuuden Seura – Finnish Literature Society</p>\n<p>The Finnish Literature Society (<a href=\"https://www.finlit.fi/en\">https://www.finlit.fi/en</a>) publishes open access scholarly digital editions of archival material as well as digital critical editions of printed works. We began using eXist-db and TEI Publisher in 2020 for all of our XML-based publications, with two editions published so far and at least three more to be published this year.</p>\n<p>Published edition links: <a href=\"https://kivi.finlit.fi/lea\">https://kivi.finlit.fi/lea</a> <a href=\"https://gottlund.finlit.fi/\">https://gottlund.finlit.fi</a></p>\n<p>The former is in Finnish only, the latter in Finnish and Swedish, but we'll be adding English to the latter in April</p>\n<hr />\n<h5 id=\"2021-04-06%3A-workflow-from-word-files-or-transkribus-to-tei-publisher\" tabindex=\"-1\">2021-04-06: Workflow from Word files or Transkribus to TEI Publisher</h5>\n<p>Elisa Bastianello, Bibliotheca Hertziana - Max Planck Institute for Art History</p>\n<p>Reto Baumgartner, University of Zurich Science IT (S3IT)</p>\n<p>The digital edition of the Heinrich Wölfflin - Gesammelte Werke (Complete Works): <a href=\"https://www.biblhertz.it/en/dept-weddigen/woelfflin\">https://www.biblhertz.it/en/dept-weddigen/woelfflin</a> <a href=\"https://www.woelfflin.uzh.ch/de.html\">https://www.woelfflin.uzh.ch/de.html</a></p>\n<h4 id=\"2020\" tabindex=\"-1\">2020</h4>\n<h5 id=\"2020-10-20-tei-vanilla-meeting\" tabindex=\"-1\">2020-10-20 TEI Vanilla meeting</h5>\n<p>More information: <a href=\"https://e-editiones.org/tei-vanilla-meeting-summary\">https://e-editiones.org/tei-vanilla-meeting-summary</a></p>\n<h5 id=\"2020-07-08-community-event-on-music-encoding\" tabindex=\"-1\">2020-07-08 Community Event on Music Encoding</h5>\n<p>More information: <a href=\"https://e-editiones.org/music-is-in-the-air/\">https://e-editiones.org/music-is-in-the-air/</a></p>\n<h5 id=\"2020-05-18-first-community-event\" tabindex=\"-1\">2020-05-18 First Community Event</h5>\n<p>More information: <a href=\"https://e-editiones.org/news/first-community-event-on-may-18th-2020/\">https://e-editiones.org/news/first-community-event-on-may-18th-2020/</a></p>\n",
      "date_published": "2022-10-22T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/shaping-the-future/",
      "url": "https://e-editiones.org/posts/shaping-the-future/",
      "title": "Shaping the future",
      "content_html": "<p>In this months meetup we’ll talk about ongoing and planned developments in TEI Publisher. There’s a long list of pending and ongoing activities over which we’ll try to give you an overview. The community is invited to contribute ideas, requests or take part in future joint funding proposals. We’ll reserve sufficient time for discussions, so please join and help shape the future!</p>\n<p>View the <a href=\"https://e-editiones.org/resources/Community1022-1.pdf\">presentation</a>.</p>\n",
      "date_published": "2022-10-04T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/names-sell-named-entity-recognition-in-tei-publisher/",
      "url": "https://e-editiones.org/posts/names-sell-named-entity-recognition-in-tei-publisher/",
      "title": "Names sell: Named entity recognition in TEI Publisher",
      "content_html": "<p>TEI Publisher 8 will include experimental support for detecting and tagging named entities in texts. The idea is to further simplify the work of editors when annotating documents via TEI Publisher’s web-based annotation editor by automatically identifying potential candidates for people, places etc.</p>\n<figure><img src=\"https://e-editiones.org/img/denny-muller-jLjfAWwHdB8-unsplash.jpg\" alt=\"\" /></figure>\n<p>If you have the development branch (or future TEI Publisher 8) installed and the named entity recognition (NER) service running (more on this below), an additional button will be shown in the top left toolbar. Clicking on it gives you a choice of NER models to use. By default those are the standard models provided by the NER engine we're using. Below we see NER in action, detecting entities in a modern-language text copied from wikipedia.</p>\n<figure><img src=\"https://e-editiones.org/img/wikipedia.gif\" alt=\"\" /><figcaption>NER in action</figcaption></figure>\n<p>Entities identified by NER get a marker in striped color, which allows users to distinguish them from annotations, which were manually tagged. The user can now review the identified entities, assign them an authority entry etc. As each annotation is reviewed, the stripes will be removed.</p>\n<p>While NER works well in this case on a modern language text, you'll soon encounter the limits of the standard model when trying it out on different types of literature. However, we can gradually improve the quality of the entity recognition by feeding completely annotated documents back into the process, i.e. train our own recognition model. The ideal workflow could be imagined as follows:</p>\n<ul>\n<li>editors manually tag a portion of documents via web-based annotations</li>\n<li>once a certain number of entities has been tagged, we can train a custom model</li>\n<li>continuing the annotation process, the custom model can be used to identify potential candidates for semantic annotations, thus improving the workflow</li>\n<li>the model is retrained on the growing set of fully annotated documents, resulting in better prediction rates</li>\n</ul>\n<p>The ultimate goal is to make this process as smooth as possible, i.e. it should not hinder your editing work, but support it!</p>\n<p>The integration in TEI Publisher is completely functional, but we need more testing, experimenting and kicking the tires with some real-world use cases. NLP is not a simple subject and I’m in no way an expert, so I’d like to invite the community to help. I have just prepared the ground work.</p>\n<h3 id=\"technical-background\" tabindex=\"-1\">Technical Background</h3>\n<p>There are plenty of NLP and NER libraries and tools. However, such libraries work on plain text, not structured texts like TEI. They will get confused by angle brackets (just like many humans). The trick thus is to transform the XML into a plain text without loosing context, which means we somehow need to keep track of element boundaries, offsets of inline elements etc.</p>\n<p>Likewise, the result of running NER is again a plain text document, accompanied by a list of detected entities and character offsets. Those need to be mapped back onto the XML structure and eventually merged into the TEI. This back-and-forth conversion is the main job handled by TEI Publisher and its API.</p>\n<p>My first idea was to integrate another, existing command-line tool for enriching TEI with named entities. But after a few first experiments, it occurred to me that TEI Publisher already had some important bits and pieces in place within the annotation framework:</p>\n<ul>\n<li>it defines a standoff JSON format to keep annotations separate from the TEI as long as the user is making changes. The web-based editor reads this format to display the nice fruit salad - i.e. marked entities - you see on screen.</li>\n<li>it implements algorithms to merge the standoff annotations into inline TEI elements. This works loss-less: anything which is not an annotation is left untouched. The merge algorithm is fast and reliable.</li>\n</ul>\n<p>We could thus reuse those building blocks and just add a communication layer, which mediates between TEI Publisher and the external NLP library. This communication layer has been realized through a set of Open API endpoints on both sides, allowing them to have a conversation, sending data back and forth. Below you see the NLP API endpoints exposed by TEI Publisher:</p>\n<figure><img src=\"https://e-editiones.org/img/NLP-API-1024x362.png\" alt=\"\" /></figure>\n<p>The NLP part is a python service using <a href=\"https://spacy.io/\" title=\"spaCy\">spaCy</a> as the underlying NLP library. Compared to many NLP libraries I have seen before, spaCy has a rather simple, clean API. Getting started proved to be smooth and painless as most of the functionality comes pre-configured and ready to be used. A Python notebook demonstrating how to do a simple NER with spaCy is shown below:</p>\n<figure><img src=\"https://e-editiones.org/img/spacy-notebook-1024x566.png\" alt=\"\" /></figure>\n<p>SpaCy can do more than just NER, e.g. part-of-speech tagging, dependency parsing, sentence segmentation, text classification, lemmatization, morphological analysis. It is also quite extensible, allowing other libraries to be plugged into its pipelines.</p>\n<h3 id=\"training-a-model\" tabindex=\"-1\">Training a model</h3>\n<p>Whenever you use a general-purpose NER model, you’ll quickly notice that it works great for some types of texts, i.e. texts similar to the ones it was trained on. However, results quickly degrade if you apply it to other genres or texts written in a slightly different period of time. For example, the German standard model in spaCy produces good results when run on a text from Wikipedia, but it already starts missing things when you apply it to letters written in the first half of the 20th century: the language used back then was just different, some would say: more sophisticated, than the language used today.</p>\n<p>For example, if we run the standard German model against a letter by theologian Karl Barth written in 1921, many words are wrongly identified as places:</p>\n<figure><img src=\"https://e-editiones.org/img/kb-generic.png\" alt=\"\" /></figure>\n<p>For most real world scenarios, there’s thus no way around training your own custom model. Fortunately this fits rather well into the annotation workflow implemented by TEI Publisher: usually, training a model involves going through a large amount of text to tell the NLP engine which words are considered part of an entity and which are not. Sometimes this is done in tabular form - which is quite tedious, but there are also tools to support the task, e.g. Prodigy, a commercial application created by the makers of spaCy.</p>\n<p>All those approaches have one disadvantage: you do all the hard work just for the purpose of training a model. Compared to this, enriching the TEI with entities is a useful task in itself. Even if you figure out later that you can’t really use NER, the work invested is not lost. TEI Publisher tries to make this as seamless as possible, being able to transform any semantically rich TEI into training data. Preparing training data is thus kind of a natural side effect of annotating documents and does not require additional manual steps or separate tagging.</p>\n<p>TEI Publisher exposes an API endpoint through which you can download training data in JSON format for either a single document or a whole collection.</p>\n<p>It chunks the text into blocks (paragraphs, headings etc.) and extracts a plain text representation of each. Here it is important that sentences are preserved semantically. Inline notes, apps or choices would appear out of context in the middle of a sentence, so they have to be removed. Notes will be moved into separate blocks at the end.</p>\n<p>All existing entities in a block, i.e. persName, placeName etc., are listed along with the text, recording their type, start and end positions:</p>\n<pre class=\"language-json\"><code class=\"language-json\">  <span class=\"token punctuation\">{</span><br />    <span class=\"token property\">\"source\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\"train/1006.xml\"</span><span class=\"token punctuation\">,</span><br />    <span class=\"token property\">\"text\"</span><span class=\"token operator\">:</span> <span class=\"token string\">\" Bultmann Marburg, 25.V.1922 Lieber Herr Barth! \"</span><span class=\"token punctuation\">,</span><br />    <span class=\"token property\">\"entities\"</span><span class=\"token operator\">:</span> <span class=\"token punctuation\">[</span><br />      <span class=\"token punctuation\">[</span><br />        <span class=\"token number\">10</span><span class=\"token punctuation\">,</span><br />        <span class=\"token number\">17</span><span class=\"token punctuation\">,</span><br />        <span class=\"token string\">\"LOC\"</span><br />      <span class=\"token punctuation\">]</span><span class=\"token punctuation\">,</span><br />      <span class=\"token punctuation\">[</span><br />        <span class=\"token number\">41</span><span class=\"token punctuation\">,</span><br />        <span class=\"token number\">46</span><span class=\"token punctuation\">,</span><br />        <span class=\"token string\">\"PER\"</span><br />      <span class=\"token punctuation\">]</span><br />    <span class=\"token punctuation\">]</span><br />  <span class=\"token punctuation\">}</span></code></pre>\n<p>The exposed API endpoint is used by the python service running spaCy to retrieve the training data. The service will normalize the data, e.g. collapse whitespace, and initiate the training. By default, 30% of the sample records will be reserved for validating the model, 70% are fed into the training. Once completed, the resulting model will become available in spaCy as a new model to be used for entity extraction.</p>\n<p>The actual training can be triggered in two ways:</p>\n<ul>\n<li>via a web page in TEI Publisher, which calls the python service, passing it the information you entered in a form</li>\n<li>via a separate python/spaCy project</li>\n</ul>\n<p>We strongly recommend the 2nd approach as it gives you more control over the process and its configuration. For simple tests, the web-based form is sufficient though.</p>\n<p>You can train a model from any collection residing below TEI Publisher’s data collection or the corresponding data collection of any custom application generated by TEI Publisher 8. For example, for the Karl Barth edition we already have several volumes of letters, which were manually enriched with entities via the web-based annotation editor. For a quick test, we can thus upload one volume of annotated letters to the <code>train/</code> subcollection below TEI Publisher's data root (using eXide) and start training a custom NER model on this collection via the web interface:</p>\n<figure><img src=\"https://e-editiones.org/img/train-barth.gif\" alt=\"\" /></figure>\n<p>The training will take a short while as it does several runs trying to improve accuracy. During the process, key figures are shown for each run and you should see how they gradually improve until a certain threshold is reached and the training stops.</p>\n<p>Afterwards the new trained model will become available within the annotation editor and we can try NER on the same letter as before using the custom model:</p>\n<figure><img src=\"https://e-editiones.org/img/barth-improved.png\" alt=\"\" /></figure>\n<p>Looking at the same passage of Barth's letter, we see that now only Göttingen is identified as a place. The wrongly detected places are gone. This is clearly an improvement over the standard model. The one name in the fragment, Nelly, is still not identified as a person, but the size of the training set was still rather small. The more documents we annotate, the more training data we have, and the quality of the model should gradually improve over time.</p>\n<h3 id=\"running-the-ner-service\" tabindex=\"-1\">Running the NER service</h3>\n<p>For named entity recognition to be available in the web-based annotation editor, a separate Python service is needed: clone the <a href=\"https://github.com/eeditiones/tei-publisher-ner\">tei-publisher-ner</a> repository and follow the instructions in the README.</p>\n<p>The tei-publisher-ner package uses spaCy’s own project configuration library, which in itself is quite a useful tool. The main configuration is contained in <code>project.yml</code>, which exposes a number of commands. You can also use those to train a custom model as an alternative to the web form we saw above. This gives you more control and more options.</p>\n<p>To train a custom model you can either change the variables in <code>project.yml</code> or pass them as command line parameters, e.g.:</p>\n<pre class=\"language-sh\"><code class=\"language-sh\">python3 <span class=\"token parameter variable\">-m</span> spacy project run all <span class=\"token builtin class-name\">.</span> <span class=\"token parameter variable\">--vars.name</span><span class=\"token operator\">=</span>hsg_demo <span class=\"token parameter variable\">--vars.app_name</span><span class=\"token operator\">=</span>hsg-annotate <span class=\"token parameter variable\">--vars.training_collection</span><span class=\"token operator\">=</span>frus1981-88v05 <span class=\"token parameter variable\">--vars.lang</span><span class=\"token operator\">=</span>en</code></pre>\n<p>This will contact a TEI Publisher generated app called <code>hsg-annotate</code>and retrieve training data from the <code>frus1981-88v05</code> collection below the app's data root, using English as the training language. The output of the command will pretty much look the same as the output you saw on the web before.</p>\n<h3 id=\"conclusion\" tabindex=\"-1\">Conclusion</h3>\n<p>Even in its current, rudimentary form, the NER integration in TEI Publisher can already help to speed up the editing workflow. We do need to gain more experience with training custom models though and the community is warmly invited to help with this.</p>\n<p>There’s also a lot of room for improving the annotation workflow, e.g. with</p>\n<ul>\n<li>automatically linking detected entities to authority entries (where non-ambiguous)</li>\n<li>implement a wizard-like dialog, which walks users through the entities identified by NER one by one, allowing them to quickly confirm or reject an annotation and associate it with the correct authority entry</li>\n<li>employ rule-based detection models in addition to the statistical, trained models: for example, if you already have a list of names from a back of book index, a rule-based algorithm may produce better results than a trained model</li>\n<li>support batch operation across multiple documents</li>\n<li>integrate other spaCy features like part-of-speech tagging etc.</li>\n</ul>\n",
      "date_published": "2022-06-10T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/newsletter-2022-1/",
      "url": "https://e-editiones.org/posts/newsletter-2022-1/",
      "title": "Newsletter 22/1",
      "content_html": "<h2 id=\"e-editiones-as-a-society\" tabindex=\"-1\">e-editiones as a Society</h2>\n<p>A highlight of the past year was e-editiones being awarded the <a href=\"https://tei-c.org/activities/rahtz-prize-for-tei-ingenuity/\">2021 TEI Community Prize</a>. The jury offered us these kind words:</p>\n<blockquote>\n<p>«The awards panel was especially impressed by the way e-editiones has managed to gather a non-profit community of those creating scholarly digital editions and made the process of doing so easier through the coordination of ongoing development of the TEI Publisher software. The awards panel also noted the provision of training opportunities and open availability of the workshop materials for those wishing to (re)learn the software in their own time.»</p>\n</blockquote>\n<figure><img src=\"https://e-editiones.org/img/jon-tyson-XmMsdtiGSfo-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@jontyson?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Jon Tyson</a> on <a href=\"https://unsplash.com/s/photos/newsletter?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>2021 has fortunately seen an increase in membership. Today there are 12 institutional and 30 individual members. However, it remains our goal to attract new members who will continuously support the association.</p>\n<p>One of e-editiones' strategic goals is to ensure the long-term availability of digital editions. To this end e-editiones supports hosting offers that also include the continuous maintenance of digital editions (software updates). This year Archives Online has set up such an offer with «Sources Online». Some of the editions associated with e-editiones already use the Sources Online servers.</p>\n<p>In February 2021, e-editiones received a grant by the Ernst Göhner Stiftung. The joint proposal was backed by a number of members and their institutions. Together with the additional generous contributions made by participating projects, this grant supported a larger part of the development work past year.</p>\n<p>With the Escher correspondence, a prominent Swiss edition has been migrated to TEI Publisher. This step has been necessary since maintenance and hosting with the previous setup became too expensive in the long term. With TEI Publisher application hosted by Sources Online, the annual costs are reduced to a third.</p>\n<h2 id=\"more-information\" tabindex=\"-1\">More Information</h2>\n<ul>\n<li><a href=\"https://e-editiones.org/members/\" title=\"Current list of members\">Current list of members</a></li>\n<li><a href=\"https://e-editiones.org/statuten-des-vereins-e-editiones-german/\" title=\"Statutes\">Statutes</a> (in German)</li>\n<li>How to <a href=\"https://e-editiones.org/how-to-become-a-member/\" title=\"become a member\">become a member</a></li>\n</ul>\n<h2 id=\"events\" tabindex=\"-1\">Events</h2>\n<h3 id=\"community-meetings\" tabindex=\"-1\">Community Meetings</h3>\n<p>e-editiones was able to hold 7 community meetings and thus contribute to the exchange of expertise. Many of the meetings were extremely well received. However, the number of participants varied greatly.</p>\n<ul>\n<li>2021-10-05 An introduction to the Distributed Text Services (DTS)</li>\n<li>2021-09-07: TEI Publisher 7.1 – configuring web annotations</li>\n<li>2021-07-06: Contributing to TEI Publisher – a gentle introduction</li>\n<li>2021-06-15: For(e) humanists – Metadata, Forms and more</li>\n<li>2021-06-01: FairCopy</li>\n<li>2021-05-04: Open access scholarly digital editions at the Finnish Literature Society: experiences with TEI Publisher</li>\n<li>2021-04-06: Workflow from Word files or Transkribus to TEI Publisher</li>\n</ul>\n<h2 id=\"workshops\" tabindex=\"-1\">Workshops</h2>\n<p>Among the workshops, special mention should be made of the 5-part introductory workshop by Anne Diekjobst and Claudia Sutter, which received very good feedback.</p>\n<ul>\n<li>2021-08-2021 Manuscript Mondays – Einführung in das digitale Edieren handschriftlicher Quellen (5-teilig)</li>\n<li>2021-03-30, 17.00 CEST Versioning and Archiving Data: TEI2Zenodo</li>\n<li>2021-03-08 Beginners Workshop (Git, Editing Workflows)</li>\n</ul>\n<p>A big thank you to all who actively participated in the meetings and workshops.</p>\n<h2 id=\"more-information-1\" tabindex=\"-1\">More Information</h2>\n<ul>\n<li><a href=\"https://www.youtube.com/channel/UCAPhSZdBwFRCEFWNNYOC4Ww\" title=\"e-editiones-YouTube-Channel\">e-editiones-YouTube-Channel</a> (3 neue Videos)</li>\n<li><a href=\"https://e-editiones.org/blog/\" title=\"e-editiones blog\">e-editiones blog</a></li>\n</ul>\n<h1 id=\"communication\" tabindex=\"-1\">Communication</h1>\n<p>On Slack, we had 218 active members at the end of 2021; on average, there were 16 active members daily, with 3 to 4 members posting a total of about 8 messages daily. On Twitter, we post 4 to 5 tweets per month. 2021 brought us 172 new followers.</p>\n<p>Our mailing list, on the other hand, is not very actively used. We are happy to receive suggestions and ideas on how to proceed with it.</p>\n<figure><img src=\"https://e-editiones.org/img/wordcloud-eeditiones-2021.png\" alt=\"\" /></figure>\n<h1 id=\"tei-publisher-developments\" tabindex=\"-1\">TEI Publisher Developments</h1>\n<p>In February 2021 e-editiones successfully applied for a grant by the Ernst Göhner Stiftung, from which we received 30000 SFR for further TEI Publisher development. The joint proposal was backed by a number of members and their institutions and included features like:</p>\n<ul>\n<li>support for web annotations</li>\n<li>versioning and long term availability</li>\n<li>persistent URLs</li>\n<li>accessibility</li>\n<li>showing and navigating events in a timeline</li>\n<li>display of mathematical formulas</li>\n</ul>\n<p>Obviously the budget did not suffice to cover everything planned, but thanks to the additional contributions provided by the member institutions, we could address the main topics and even go beyond in some areas.</p>\n<h2 id=\"web-annotations\" tabindex=\"-1\">Web Annotations</h2>\n<p>The most visible feature is the editor for web-based annotations, released in version 7.1.0. The development team had been contemplating this feature already for a couple years and thanks to additional generous funding by the Office of the Historian at the US Department of State, it finally became reality. Being able to annotate TEI documents via a graphic, web based interface eases the burden of enhancing a transcription with semantic, analytic or text-critical markup. Users work in a user-friendly environment in which XML code is neatly hidden from sight. The integration of external authority databases saves a lot of time, improves consistency and opens possibilities for data exchange and interoperability. At the same time, the annotation editor is fully configurable, allowing complex, nested markup where necessary. Several member institutions are actively using the editor in their daily work and continue to contribute to its development.</p>\n<p>The annotation editor marks the first milestone in our endeavour to extend TEI Publisher to support the entire editing workflow rather than just publishing the end result. Further steps are already in planning, e.g. form-based editing of the TEI header, which will offer the same level of customizability and extensibility.</p>\n<h2 id=\"web-components\" tabindex=\"-1\">Web Components</h2>\n<p>Several new web components have been released during the past year: most notable, a new timeline component allows users to visualise dates and events in an interactive, graphical display. The component can be used to directly select a date or date range, or it can be connected to a facetted search to drill down into a collection of items. Development was supported by the Staatsarchiv Zürich. This component is prominently featured in the remake of the Alfred Escher correspondence edition (to be announced soon).</p>\n<p>The Bernoulli edition in Basel financed a component to display mathematical formulas embedded in the TEI text, using either MathML or TeX notation. Other new components include a grid element for viewing tabular data, and a &quot;split list&quot;, which comes handy when browsing lists of places, people or abbreviations. The latter was again financed by the Staatsarchiv Zürich and first appeared in the Escher correspondence.</p>\n<p>As usual, many other components have seen major improvements needed by concrete projects. For example, the map component is now able to display a large number of places at once by clustering the markers.</p>\n<h2 id=\"tei-publisher-8\" tabindex=\"-1\">TEI Publisher 8</h2>\n<p>The next major release of TEI Publisher is currently being finalized. It will include a few breaking changes, mainly in the libraries used, but as usual we're aiming to remain as backwards compatible as possible. One reason for the breaking changes is to better support persistent, bookmarkable URLs as well as browsing the navigation history. The goal is to make the URL structure as seen by the end-user completely independent of the underlying organization of documents and collections. This involves both a server- and client-side part.</p>\n<p>The main remaining task on the way to the release is to extensively document the possibilities and approaches enabled by those changes.</p>\n<h2 id=\"other-software-packages\" tabindex=\"-1\">Other Software Packages</h2>\n<p>In line with our modular development policy, a number of software packages which should be considered part of Publisher 8 are published in separate repositories:</p>\n<ul>\n<li><a href=\"https://github.com/eeditiones/tuttle\">tuttle - a Git Integration for eXist-db</a> (stable): allows synchronizing a data collection directly from a github or gitlab repository to the database. It can deal with multiple repositories as well as incremental updates. Thanks to the Karl Barth Gesamtausgabe for contributing funding.</li>\n<li><a href=\"https://github.com/eeditiones/tei-publisher-ner\">TEI Publisher Named Entity Recognition API</a> (beta): adds named entity recognition to the web-based annotation editor. Use it to identify places, people and other entities while annotating a document. The package also provides scripts to train your own model based on already annotated documents via machine learning. Training data is automatically extracted from the annotated document by TEI Publisher, so there's no need to go through the tedious task of compiling suitable data by hand.</li>\n<li><a href=\"https://github.com/eeditiones/tei-publisher-static\">Static Site Generator for TEI Publisher</a> (beta): transform a website based on TEI Publisher into a static version, which no longer requires TEI Publisher nor eXist-db. The feature intends to provide a low cost option for small editions whose main purpose is to allow users to browse through a collection of texts without demanding sophisticated search or navigation facilities. Generated files can be easily hosted on free services like GitHub pages. To see it in action, visit <a href=\"https://guidelines.teipublisher.com/\">our viewer for the TEI Guidelines</a>, which we used as a testbed.</li>\n<li><a href=\"https://github.com/eeditiones/teipublisher-docker-compose\">Docker Compose Configuration</a> (beta): a configuration to help users install a TEI Publisher-based application on a docker-enabled host. It handles the more difficult tasks of installing a reverse proxy in front of Publisher as well as registering an SSL certificate. Hosting via docker compose can be a viable option for smaller projects with limited budget and users who lack the server administration skills necessary to set up a dedicated hosting service.</li>\n<li><a href=\"https://github.com/jinntec/fore\">Fore</a>: an XForms-inspired library for building complex forms with web components. While this is not an integral part of TEI Publisher yet, it will become the fundament for many of the future, workflow-related features we have in mind (see below).</li>\n</ul>\n<h1 id=\"the-future\" tabindex=\"-1\">The Future</h1>\n<p>The e-editiones board will prepare a new joint funding proposal soon. To be successfull we'll again need projects or institutions to express interest and signal readiness to make a contribution (in whatever way). If you are working with TEI Publisher and wish for a certain feature, please do not hesitate to contact us, so we can add it to the list of topics.</p>\n<p>A main area we currently have in mind is to further enhance TEI Publisher with respect to supporting the editorial workflow:</p>\n<ul>\n<li>integrate general metadata - i.e. TEI header - editing facilities based on customizable forms</li>\n<li>add an interface to manage local authorities within the annotation framework</li>\n<li>support other annotation types, e.g. empty elements and stand-off annotations which are not inlined</li>\n<li>named entitiy recognition: automatically connect detected entities with matching authority entries</li>\n<li>allow batch processing of entire documents via named entity recognition</li>\n<li>support multi-user workflows with support for a annotate/review/merge process</li>\n</ul>\n<p>Other areas might be:</p>\n<ul>\n<li>a form-based interface to customize basic settings and CSS variables</li>\n<li>direct integration with Transkribus and other HTR/OCR software</li>\n<li>support for other input formats (Excel, CSV)</li>\n<li>remove the dependency on Google Material Design to make all visual aspects configurable</li>\n<li>port the core TEI processing model implementation to be usable without eXist (e.g. directly within oXygen)</li>\n<li>drop the somewhat arbitrary distinction between browsing and searching currently imposed by publisher and refactor the search API to be more easily customizable</li>\n<li>enhance and speed up search result display (KWIC)</li>\n</ul>\n<p>If any of this rings a bell, please consider if you could support it by taking part in the joint funding proposal. Obviously we'll also be more than happy to pick up suggestions not yet on the list.</p>\n",
      "date_published": "2022-04-05T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/cultural-heritage-grant-ukraine/",
      "url": "https://e-editiones.org/posts/cultural-heritage-grant-ukraine/",
      "title": "Call for Applications / Оголошення про подачу заявок",
      "content_html": "<p><a href=\"https://e-editiones.org/posts/cultural-heritage-grant-ukraine/#ukr\">Українська <img src=\"https://e-editiones.org/img/ukraine-1.png\" alt=\"\" /></a></p>\n<h1 id=\"small-grants-program-for-scholars-affected-by-war-in-ukraine\" tabindex=\"-1\">Small grants program for scholars affected by war in Ukraine</h1>\n<p><img src=\"https://e-editiones.org/img/ukraine-3-279x300.png\" alt=\"\" class=\"left\" />e-editiones and the <a href=\"https://tei-c.org/\">TEI Consortium</a> in collaboration with <a href=\"https://archives-online.org/\">Archives Online</a> and <a href=\"https://jinntec.de/\">JinnTec</a> announce a small grant program aiming to help scholars of Ukrainian cultural heritage to continue their work that has been disrupted by the Russian invasion of Ukraine. We urge other institutions to support this call so we can offer funding for more of our colleagues affected by the war.</p>\n<h2 id=\"who-is-eligible%3F\" tabindex=\"-1\">Who is eligible?</h2>\n<p>Any scholar who had to leave Ukraine or relocate within Ukrainian territory because of the war and is working on sources broadly conceived as textual cultural heritage and plans to make data and results openly available.</p>\n<h2 id=\"what-is-offered%3F\" tabindex=\"-1\">What is offered?</h2>\n<ul>\n<li>Initial funding ranging between 500 and 2000 EUR to support the continuation of research work on materials related to cultural heritage available in TEI</li>\n<li>Help with encoding and other conceptual aspects of a digital edition</li>\n<li>Technical support in converting data sources into the TEI Standard and/or publishing them as a digital edition online</li>\n<li>Hosting of the edition for at least 3 years on Sources Online servers</li>\n</ul>\n<h2 id=\"how-to-apply%3F\" tabindex=\"-1\">How to apply?</h2>\n<p>Please send a brief description of the project and its current state to <a href=\"mailto:info@e-editiones.org\">info@e-editiones.org</a>. Applications will be reviewed on an ongoing basis. The number of grants awarded will depend on the funding contributions we will be able to secure, the confirmed initial pool is 10 000 EUR. Please include a description of your personal situation and why you should be eligible.</p>\n<h2 id=\"how-can-i-contribute%3F\" tabindex=\"-1\">How can I contribute?</h2>\n<p>If you or your organization would like to contribute funds or services to this initiative, please email <a href=\"mailto:info@e-editiones.org\">info@e-editiones.org</a> with details. Individuals are encouraged to donate via <a href=\"https://www.paypal.com/donate/?hosted_button_id=ST7PNHJK3FMX8\">PayPal</a>. e-editiones is registered as a non-profit society in Switzerland.</p>\n<h2 id=\"supporters\" tabindex=\"-1\">Supporters</h2>\n<ul style=\"line-height: 96px;\">\n  <li><a href=\"https://www.sagw.ch/sagw/\">SAGW</a> (Swiss Academy of Humanities and Social Science)</li>\n  <li><a href=\"https://e-editiones.org/\"><img src=\"https://e-editiones.org/img/e-editiones-logo-color.svg\" height=\"64\" /></a></li>\n  <li><a href=\"https://tei-c.org/\"><img src=\"https://tei-c.org/Vault/Logos/TEIlogo.svg\" height=\"64\" /></a></li>\n  <li><a href=\"https://jinntec.de/\"><img src=\"https://jinntec.de/images/jinntec-logo.svg\" /></a></li>\n  <li>Archives Online</li>\n</ul>\n<hr />\n<h1 id=\"%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%B0-%D0%BC%D0%B0%D0%BB%D0%B8%D1%85-%D0%B3%D1%80%D0%B0%D0%BD%D1%82%D1%96%D0%B2-%D0%B4%D0%BB%D1%8F-%D0%B2%D1%87%D0%B5%D0%BD%D0%B8%D1%85%2C-%D1%8F%D0%BA%D1%96-%D0%BF%D0%BE%D1%81%D1%82%D1%80%D0%B0%D0%B6%D0%B4%D0%B0%D0%BB%D0%B8-%D0%B2%D1%96%D0%B4-%D0%B2%D1%96%D0%B9%D0%BD%D0%B8-%D0%B2-%D1%83%D0%BA%D1%80%D0%B0%D1%97%D0%BD%D1%96\" tabindex=\"-1\">Програма малих грантів для вчених, які постраждали від війни в Україні</h1>\n<p>e-editiones та <a href=\"https://tei-c.org/\" title=\"TEI Consortium\">Консорціум TEI</a> у співпраці з <a href=\"https://archives-online.org/\" title=\"Archives Online\">Archives Online</a> і <a href=\"https://jinntec.de/\" title=\"JinnTec\">JinnTec</a> оголошують програму невеликих грантів, спрямовану на допомогу дослідникам української культурної спадщини, щоб ті могли продовжувати свою роботу, перервану вторгненням Росії в Україну. Ми закликаємо інші установи підтримати цей звернення, щоб ми могли запропонувати фінансування для більшої кількості наших колег, що постраждали від війни.</p>\n<h2 id=\"%D1%85%D1%82%D0%BE-%D0%BC%D0%B0%D1%94-%D0%BF%D1%80%D0%B0%D0%B2%D0%BE%3F\" tabindex=\"-1\">Хто має право?</h2>\n<p>Будь-який науковець, який був змушений виїхати з України чи переїхати в межах української території через війну і працює над джерелами, що широко розуміються як текстова культурна спадщина та планує викласти дані та результати у відкритому доступі.</p>\n<h2 id=\"%D1%89%D0%BE-%D0%BF%D1%80%D0%BE%D0%BF%D0%BE%D0%BD%D1%83%D1%94%D1%82%D1%8C%D1%81%D1%8F%3F\" tabindex=\"-1\">Що пропонується?</h2>\n<ul>\n<li>Початкове фінансування від 500 до 2000 євро для підтримки продовження науково-дослідницької роботи над матеріалами, що стосуються культурної спадщини, доступними в TEI</li>\n<li>Допомога з кодуванням та іншими концептуальними аспектами цифрового видання</li>\n<li>Технічна підтримка перетворення джерел даних у стандарт TEI та/або їх публікація у вигляді цифрового видання в Інтернеті</li>\n<li>Хостинг видання не менше 3 років на серверах Sources Online</li>\n</ul>\n<h2 id=\"%D1%8F%D0%BA-%D0%BF%D0%BE%D0%B4%D0%B0%D1%82%D0%B8-%D0%B7%D0%B0%D1%8F%D0%B2%D0%BA%D1%83%3F\" tabindex=\"-1\">Як подати заявку?</h2>\n<p>Будь ласка, надішліть короткий опис проекту та його поточний стан на адресу <a href=\"mailto:info@e-editiones.org\">info@e-editiones.org</a>. Заявки розглядатимуться на постійній основі. Кількість наданих грантів залежатиме від фінансових внесків, які ми зможемо забазпечити, при підтвердженому початковому бюджеті 10000 євро. Будь ласка додайте опис вашої особистої ситуації та обгрунтуйте, чому ваша кандидатура має бути розглянута позитивно.</p>\n<h2 id=\"%D1%8F%D0%BA-%D1%8F-%D0%BC%D0%BE%D0%B6%D1%83-%D0%B7%D1%80%D0%BE%D0%B1%D0%B8%D1%82%D0%B8-%D1%81%D0%B2%D1%96%D0%B9-%D0%B2%D0%BD%D0%B5%D1%81%D0%BE%D0%BA%3F\" tabindex=\"-1\">Як я можу зробити свій внесок?</h2>\n<p>Якщо ви або ваша організація бажаєте внести кошти чи послуги на користь цієї ініціативи, будь ласка, напишіть деталі на адресу <a href=\"mailto:info@e-editiones.org\">info@e-editiones.org</a>. Фізичним особам пропонується робити пожертви через <a href=\"https://www.paypal.com/donate/?hosted_button_id=ST7PNHJK3FMX8\">PayPal</a>. e-editiones є зареєстровані як некомерційна організація у Швейцарії.</p>\n<ul style=\"line-height: 96px;\">\n  <li><a href=\"https://www.sagw.ch/sagw/\">SAGW</a> (Swiss Academy of Humanities and Social Science)</li>\n  <li><a href=\"https://e-editiones.org/\"><img src=\"https://e-editiones.org/img/e-editiones-logo-color.svg\" height=\"64\" /></a></li>\n  <li><a href=\"https://tei-c.org/\"><img src=\"https://tei-c.org/Vault/Logos/TEIlogo.svg\" height=\"64\" /></a></li>\n  <li><a href=\"https://jinntec.de/\"><img src=\"https://jinntec.de/images/jinntec-logo.svg\" /></a></li>\n  <li>Archives Online</li>\n</ul>",
      "date_published": "2022-03-29T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-community-prize/",
      "url": "https://e-editiones.org/posts/tei-community-prize/",
      "title": "e-editiones receives TEI Community Prize",
      "content_html": "<p>We are deeply honoured that e-editiones has been awarded the <a href=\"https://tei-c.org/activities/rahtz-prize-for-tei-ingenuity\">2021 TEI Community Prize</a>! The awards panel offered us these kind words:</p>\n<blockquote>\n<p>The awards panel was especially impressed by the way e-editiones has managed to gather a non-profit community of those creating scholarly digital editions and made the process of doing so easier through the coordination of ongoing development of the TEI Publisher software. The awards panel also noted the provision of training opportunities and open availability of the workshop materials for those wishing to (re)learn the software in their own time.</p>\n</blockquote>\n<figure><img src=\"https://e-editiones.org/img/ray-hennessy-gdTxVSAE5sk-unsplash-1024x681.jpg\" alt=\"\" /><figcaption>Colorful fireworks over a lake. Photo by <a href=\"https://unsplash.com/@rayhennessy?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Ray Hennessy</a> on <a href=\"https://unsplash.com/s/photos/fireworks?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a>\n</figcaption></figure>\n<p>We are delighted that our efforts to build a thriving, diverse, and supportive open source software community together resonate so strongly with the broader community of TEI practitioners. The roots of e-editiones run deep in the TEI—starting with our initial implementation of the TEI Processing Model and continuing with the development and expansion of TEI Publisher. Throughout, we have been relentlessly driven by the simple goal to empower editors—whose digital training may focus on TEI encoding—to create high quality, sustainable, and interoperable publications. TEI Publisher is the synergistic product of strengths of our contributors: deep expertise in textual scholarship and TEI combined with technical excellence and sensitivity to the needs of humanities scholars. We are striving to carry on the legacy of Sebastian Rahtz’s passion, sharing his community-oriented, open-source-first approach, and a wish to work on challenging projects that advance the state of the field for the entire TEI Community.</p>\n<p>In the community spirit, we will use the prize as a seed fund to expand our set of high quality examples to domains and use cases not yet covered in the TEI Publisher's demo collection. A call for contributions will be announced shortly.</p>\n",
      "date_published": "2021-10-27T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/call-for-proposals-big-prizes/",
      "url": "https://e-editiones.org/posts/call-for-proposals-big-prizes/",
      "title": "Call for Proposals",
      "content_html": "<p>We are thrilled and deeply honoured that e-editiones has been awarded the <a href=\"https://tei-c.org/activities/rahtz-prize-for-tei-ingenuity/\">2021 TEI Community Prize</a>. We would like to reinvest the funds into a community challenge, with its own big prizes!</p>\n<figure><img src=\"https://e-editiones.org/img/brett-jordan-MHS7g_q-6mE-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/ja/@brett_jordan?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Brett Jordan</a> on <a href=\"https://unsplash.com/s/photos/apply?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>Many users explore the possibilities of TEI by looking at TEI Publisher's <a href=\"https://teipublisher.com/\">Featured Demos collection</a>. Very often they use the provided encoding examples and re-use code snippets to build their own custom edition. We are aware how important it is for the community to have an extensive set of high quality examples covering the various domains, languages, and research approaches. While highly praised, the examples available in TEI Publisher so far cover only a limited range of applications and represent only a small selection of what can be done. To extend this collection we desperately need you—the experts in the field!</p>\n<p>E-editiones encourages everyone to propose examples which could serve as a model or blueprint for other users working on digital editions. If you have something in mind, please send a short proposal to the e-editiones board, briefly describing the source material you'd like to make available, major points of interest regarding the TEI encoding (or an encoded sample), as well as the features, techniques, or area of research you would like to demonstrate with it. If the board agrees on incorporating your example, you will receive <strong>500 Swiss Francs</strong> as compensation for your preparation effort, and we'll help you with technical questions you may have along the way.</p>\n<figure><img src=\"https://e-editiones.org/img/large_000000.jpg\" alt=\"\" /></figure>\n<p>Finished examples will include the source TEI under a license allowing redistribution, an ODD for display, and, where necessary, an HTML template. We in particular look for examples covering one or more of the following areas:</p>\n<ul>\n<li>The sample TEI material is from a domain or focuses on research topics not yet covered by TEI Publisher examples.</li>\n<li>It demonstrates one or more particular features of the TEI Processing Model and TEI Publisher in a way other users can learn from. For example, ODD processing model rules, a special use of components in an HTML template, or well-designed, high quality print output.</li>\n<li>It covers languages or scripts not currently represented in TEI Publisher, especially RTL or CJK languages. We would appreciate if this could be accompanied by a translation into one of the European languages to make the example easier to interpret for users unfamiliar with a particular script.</li>\n</ul>\n<p>The first 5 proposals accepted will receive 500 Swiss Francs each upon delivery of the complete sample. For the first round, proposals should be submitted to the board via email (<a href=\"mailto:info@e-editiones.org\" title=\"info@e-editiones.org\">info@e-editiones.org</a>) until <strong>Dec. 10, 2021</strong>.</p>\n",
      "date_published": "2021-10-27T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-conference-2021-talk-flexible-browser-based-annotations-for-tei/",
      "url": "https://e-editiones.org/posts/tei-conference-2021-talk-flexible-browser-based-annotations-for-tei/",
      "title": "TEI Conference 2021 Talk: &quot;Flexible, Browser-Based Annotations for TEI&quot;",
      "content_html": "<p>Wolfgang Meier and Joe Wicentowski explain the web-based annotation feature introduced with TEI Publisher 7.1. We briefly introduce TEI Publisher 7.1's <a href=\"https://teipublisher.com/exist/apps/tei-publisher/doc/documentation.xml?id=web-annotations\">Annotation Facility</a> and the workflows it supports. Joe Wicentowski then demonstrates how the <a href=\"https://history.state.gov/\">Office of the Historian</a> uses the tool to annotate documents from the Foreign Relations series.</p>\n<iframe title=\"YouTube video player\" src=\"https://www.youtube.com/embed/5eVilDacrtA\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>",
      "date_published": "2021-10-26T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/digital-editions-survival-kit/",
      "url": "https://e-editiones.org/posts/digital-editions-survival-kit/",
      "title": "Digital editions survival kit",
      "content_html": "<h2 id=\"reconstructing-an-edition\" tabindex=\"-1\">Reconstructing an edition</h2>\n<p>Computer systems are not meant to last, to the contrary - not only do they require regular maintenance but we need to take into account the unavoidable cycle of major refurbishments. This paper, just presented at the virtual TEI conference, aims to demonstrate how critically important aspects of an edition can be reconstructed from a rather minimal data set and how such a <em>survival kit</em> can be useful not only for disaster recovery but also as a sustainable approach for the maintenance of scholarly publications.</p>\n<figure><img src=\"https://e-editiones.org/img/survivalkit.png\" alt=\"\" /><figcaption>Poster for 2021 TEI Conference by Magdalena Turska</figcaption></figure>\n<p>The following schemata are the key components of the <em>survival kit</em>:</p>\n<ul>\n<li>Source documents</li>\n<li>Document encoding and transformation scheme</li>\n<li>Layout templates</li>\n<li>Interoperable metadata mapping specification</li>\n</ul>\n<p>TEI is the perfect archival format for text-centric data: human readable and easy to process - as long as we have the capacity to read text files we can recover the information from a repository of TEI texts. TEI encoded documents with an associated ODD schema and documentation already form a solid basis for reconstruction even if the ODD would say nothing about the final form of the publication as intended by the editors.</p>\n<figure><img src=\"https://e-editiones.org/img/processingmodel.png\" alt=\"\" /><figcaption>TEI source and rendition via the Processing Model</figcaption></figure>\n<p>The TEI Processing Model covers part of this territory, describing how a source document should be transformed for publication. Nevertheless, in the virtual realm, the document is always accompanied by a certain context on the page: controls to zoom in or out, facing facsimile image or switch between normalized and original spellings, just to name a few options. To explicitly define such a context and specify how a publication page would look and behave we can rely on HTML5 layout templates. A modern, web components based approach to website design gives us a beautifully simple and expressive method of assembling web pages from a virtual Lego block equivalent.</p>\n<figure><img src=\"https://e-editiones.org/img/components.png\" alt=\"\" /><figcaption>HTML5 page layout using web components</figcaption></figure>\n<p>The last missing piece is to document how abstract concepts, e.g. author or date of creation are realized in the encoding so we can recover and use them for queries within the publication as well as for data interchange with other systems. Given the richness of TEI it’s impossible to prescribe what metadata needs to be gathered and how exactly it should be encoded in any given project. On the other hand, it is rather simple to express the mapping in XML, e.g. with an index configuration syntax.</p>\n<figure><img src=\"https://e-editiones.org/img/indexconfiguration.png\" alt=\"\" /><figcaption>Sample index configuration with fields and facets</figcaption></figure>\n<p>Such a set of specifications preserves all the information necessary to rebuild the edition from scratch, focusing on the intentions and decisions of the editor while filtering out the ephemeral or secondary presentation aspects. Good to put in the vault and send into space but equally useful when the time to migrate to a new infrastructure comes.</p>\n<figure><img src=\"https://e-editiones.org/img/dodis.png\" alt=\"\" /><figcaption>Original Dodis layout</figcaption></figure>\n<p>How does it work in practice? You might want to have a closer look at one of the TEI Publisher's demo apps <a href=\"https://github.com/eeditiones/dodis-wall\"><em>When the Wall came Down</em></a> which we managed to recreate on the basis of TEI sources and accompanying ODD released by Dodis on the 30th anniversary of the Fall of the Berlin Wall. We managed to get a draft version in only 165 lines of custom code and during just one day of pre-conference workshop. Our task would be still simpler if we also had the web page template and index configuration available.</p>\n<figure><img src=\"https://e-editiones.org/img/wall.png\" alt=\"\" /><figcaption>Recreated document view</figcaption></figure>\n<p>Given that there's barely an extra effort involved in assembling the survival kit, preparing it is a clear win. After all, we already have the sources and the ODD! Enriching it with a processing model is not particularly difficult, especially if we use it to generate our transformations. Similarly, in most database systems we will need to prepare the index configurations. At this point we probably don't need to mention that TEI Publisher already implements this approach since quite a few versions (ODD with the processing model from inception, web components for user interface since version 4 and fields and facets since version 5).</p>\n<p>Just think about it, if you pack your edition nicely, it becomes a present which archives and libraries would very much like to keep safe in their vaults and running on their servers forever...</p>\n",
      "date_published": "2021-10-26T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/manuscript-mondays/",
      "url": "https://e-editiones.org/posts/manuscript-mondays/",
      "title": "Manuscript Mondays – Einführung in das digitale Edieren handschriftlicher Quellen",
      "content_html": "<p>by Anne Diekjobst, Claudia Sutter</p>\n<p>Der Workshop richtet sich an Forschende aus verschiedenen Disziplinen, die ihre erste eigene digitale Edition erstellen wollen, die sich aber überfordert fühlen von der Fülle der verfügbaren Hilfsmittel, die online zu finden sind. Wir wollen eine niederschwellige Einführung für die ersten Schritte bieten, einen Mix aus Vortrag und Workshop vornehmen und uns die Zeit nehmen, individuelle Fragen und Probleme zusammen zu besprechen. Der Workshop bietet eine begleitete Einführung, bei der die Teilnehmenden viel Zeit haben, das Gehörte selbst anzuwenden. Ziel ist es, eine eigenständige digitale Edition in TEI/XML zu erstellen und im TEI Publisher darzustellen.</p>\n<figure><img src=\"https://e-editiones.org/img/kiwihug-5bzMOpMTDRM-unsplash.jpg\" alt=\"\" /></figure>\n<p>The workshop is <strong>free</strong> and will be held in <strong>German</strong> over 5 Mondays. A registration is not required. Just join the <a href=\"https://meet.existsolutions.com/workshop\">meeting room</a>.</p>\n",
      "date_published": "2021-08-20T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/annotation-editor-released-with-new-tei-publisher-7-1-0/",
      "url": "https://e-editiones.org/posts/annotation-editor-released-with-new-tei-publisher-7-1-0/",
      "title": "Annotation editor released with new TEI Publisher 7.1.0",
      "content_html": "<p>Answering the secret dream of many TEI users, the new TEI Publisher version 7.1.0 incorporates a — beautifully simple to use, yet powerful — way to enrich existing TEI documents. Just select a text passage, click on a button and within seconds — and without a pointy bracket in sight! — mark it as one of many supported annotation types. A place or person? Sure, and with built-in connectors for external authority files, too. Critical apparatus entries? We got you! Dates, corrections, regularizations and even quick fixes for typos in your transcription.</p>\n<p>As usual, everything is customizable and extendable, so if you want a particular kind of annotation we do not support out of the box, it's not difficult to add your own or tinker existing ones. Read more in the <a href=\"https://teipublisher.com/exist/apps/tei-publisher/doc/documentation.xml?odd=docbook.odd&amp;id=web-annotations\">documentation</a>.</p>\n<p>The good news doesn't end there: you can now use the TEI formula element with TeX notation for math. See the component's <a href=\"https://unpkg.com/@teipublisher/pb-components@1.24.17/dist/api.html#pb-formula.1\">demo</a> page which presents some elaborate formulae or visit Publisher's Demo collection which now sports shiny new examples: <em>Euler's Algebra</em> for a wee help with your quadratic equations or <em>The Italienische Madrigal</em> by Alfred (not Albert!) Einstein, with musical scores encoded with MEI. It is nicely rendered with Verovio library through a dedicated pb-mei component and you can even listen to the piece to cheer up. And you can now set Publisher's interface even to simplified or traditional Chinese.</p>\n<p>TEI Publisher 7.1.0 is available as an application package on top of the eXist XML Database. Install it into a recent eXist (5.0.0 or newer) by going to the dashboard and selecting TEI Publisher from the package manager.</p>\n<p>For more information refer to the <a href=\"https://teipublisher.com/exist/apps/tei-publisher/doc/documentation.xml?odd=docbook.odd\">documentation</a> or visit the <a href=\"https://teipublisher.com/exist/apps/tei-publisher/\">homepage</a> to play around with it.</p>\n<p>It's not for the first time that our special thanks go to the <a href=\"https://history.state.gov/\">Office of the Historian of the United States Department of State</a> - this time for funding the major portion of the annotation editor. The Math support has been kindly funded by <a href=\"https://bez.unibas.ch/de/\">Bernoulli-Euler Zentrum</a> in Basel.</p>\n",
      "date_published": "2021-08-10T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/fore-humanists-metadata-forms-and-more/",
      "url": "https://e-editiones.org/posts/fore-humanists-metadata-forms-and-more/",
      "title": "For(e) humanists - Metadata, Forms and more",
      "content_html": "<p>2021-06-15: For(e) humanists - Metadata, Forms and more</p>\n<p>Joern Turner, eXistSolutions and Jinntec GmbH</p>\n<p>Fore is a model-driven forms framework that follows the ideas of the XForms 2.0 Standard but translates those into the world of HTML5 Web Components.</p>\n<p>Many edition project require some sort of complex input form sooner or later - just think about collecting metadata for the TEI header. The talk will focus on TEI and show you how to author such forms in HTML5.</p>\n<p><a href=\"https://meet.existsolutions.com/eeditiones\">https://meet.existsolutions.com/eeditiones</a></p>\n",
      "date_published": "2021-06-15T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/contributing-to-tei-publisher-a-gentle-introduction/",
      "url": "https://e-editiones.org/posts/contributing-to-tei-publisher-a-gentle-introduction/",
      "title": "Contributing to TEI Publisher - a gentle introduction",
      "content_html": "<p>Talk by Wolfgang Meier (eXist Solutions) on Tuesday, the 6th of July 2021 at 17:00 CEST.</p>\n<p>Open source projects like TEI Publisher depend on an active, contributing community. Many believe that you need to be a programmer to contribute, but this is a misconception! Documentation, communication, supporting users or providing feedback are at least as important for an open source project as thousands of lines of code.</p>\n<p>This session targets non-programmers as well as those with some development skills. We'll start with simple things, e.g. contributing to the <a href=\"https://faq.teipublisher.com/\" title=\"FAQ\">FAQ</a>, and then move on and show you how to create your own little web component to plug into TEI Publisher. We'll use a grid component for displaying tabular data as an example.</p>\n<p>Open source projects like TEI Publisher depend on an active, contributing community. Many believe that you need to be a programmer to contribute, but this is a misconception! Documentation, communication, supporting users or providing feedback are at least as important for an open source project as thousands of lines of code.</p>\n<p>This session targets non-programmers as well as those with some development skills. We'll start with simple things, e.g. contributing to the <a href=\"https://faq.teipublisher.com/\" title=\"FAQ\">FAQ</a>, and then move on and show you how to create your own little web component to plug into TEI Publisher. We'll use a grid component for displaying tabular data as an example.</p>\n",
      "date_published": "2021-06-15T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/new-hosting-offer/",
      "url": "https://e-editiones.org/posts/new-hosting-offer/",
      "title": "Archives Online offers hosting in cooperation with e-editiones",
      "content_html": "<p>In cooperation with e-editiones, <a href=\"https://www.archives-online.org/\">Archives Online</a> is building an infrastructure for digital scholarly editions based on <a href=\"https://teipublisher.com/\">TEI Publisher</a> and <a href=\"https://iiif.io/\">IIIF</a>. It is offering comprehensive, long-term support and maintenance to keep digital editions from going dark. The offer is <strong>available to all interested editions</strong> world-wide.</p>\n<p>The offer will be complemented by a portal, which allows users to search across all editions participating in the service. The portal application has been developed by e-editiones, Archives Online and the <a href=\"https://www.zh.ch/de/direktion-der-justiz-und-des-innern/staatsarchiv.html\">Staatsarchiv Zürich</a>, and will go online as soon as the first editions are ready for publication. All code will be made available as free software. The distributed search feature was based on earlier work financed by the <a href=\"https://www.dipf.de/\">DIPF Berlin</a> (Leibniz Institute for Research and Information in Education), and the <a href=\"https://theologie.unibas.ch/de/karl-barth-zentrum/gesamtausgabe/\">Karl Barth-Gesamtausgabe</a> supported the server set up and automation.</p>\n<p>The goal is to provide an easy, long-term hosting option for editions based on minimal, well-documented requirements: ultimately any edition which complies with the recommended practices can benefit from the hosting offer and participate in the portal service.</p>\n<p>If you are interested in having an edition hosted, please contact <a href=\"mailto:info@archives-online.org\">Archives Online</a>. The service will not be for free: any serious long-term hosting has to cover certain maintenance costs if it wants to follow more than an &quot;install and forget&quot; policy. But we're confident that our solution minimizes the costs while providing the best possible service, in particular if you're looking towards long-term availability.</p>\n<h1 id=\"technical-background\" tabindex=\"-1\">Technical Background</h1>\n<p>e-editiones central goal is to provide editions with a sustainable publishing solution which ensures long term availability with minimal maintenance. With the redesign of TEI Publisher 6 and 7, we prepared the necessary technical foundations: all editions generated by TEI Publisher now share a common API.</p>\n<p>With the new version 7 it became possible to:</p>\n<ol>\n<li>host multiple editions created with different versions of the libraries side by side,</li>\n<li>simplify the update procedure to make sure editions benefit from new developments while keeping maintenance costs very low,</li>\n<li>search across local and distributed editions (hosted on a different server) by leveraging the shared API</li>\n</ol>\n<p>Also, despite looking different on the surface, the building blocks for any TEI Publisher-based edition are the same, which allows server administrators to create automated setup and maintenance routines.</p>\n<h1 id=\"outlook\" tabindex=\"-1\">Outlook</h1>\n<p>Among many other things, TEI Publisher 8 will further improve the architecture by introducing more generic concepts for persistent URLs, navigation and addressing documents, allowing editions to use an addressing scheme which better reflects the logic of the edition rather than technical requirements.</p>\n<p>A direct integration with git will allow editions to update published data without having to touch the command line.</p>\n<p>The upcoming version will also include index configuration and API endpoints for local and distributed portal search, so generated editions can automatically participate in a multi-edition portal like sources-online.</p>\n<p>With these low-level technical questions solved, e-editiones is now also putting a strong focus on describing the practical recommendations for the encoding of texts. The idea is to create a set of best practice guidelines for corpora with a pledge that any text following these guidelines will look good out of the box when rendered via TEI Publisher and will be ready for incorporation into the search portal. Initial work is carried out now and we expect a community meetup soon to discuss on a broader forum.</p>\n<p>This way we aim to: flatten the learning curve for many projects starting with TEI encoding, reduce the amount of customization work required for an edition, allowing users to publish materials with minimal effort, and assure that the project data is ready to be integrated into larger scale search portals. Needless to say, recommendations we have in mind are intended only with an eye towards interoperability and do not limit in any way customization capacities already embodied by the TEI Publisher approach.</p>\n",
      "date_published": "2021-03-28T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/beginner-workshop/",
      "url": "https://e-editiones.org/posts/beginner-workshop/",
      "title": "Beginners Workshop (Git, Editing Workflows)",
      "content_html": "<ul>\n<li>A Gentle Introduction to Git (Joseph Wicentowski)</li>\n<li>Workflows for TEI Editing and App Development (Wolfgang Meier)</li>\n</ul>\n<p>A recording is available on the e-editiones <a href=\"https://www.youtube.com/watch?v=dyY539HzN6Q\">youtube channel</a>.</p>\n<figure><img src=\"https://e-editiones.org/img/headway-5QgIuuBxKwM-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@headwayio?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Headway</a> on <a href=\"https://unsplash.com/s/photos/workshop?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>The workshop is <strong>free</strong>. A registration is not required. Just join the <a href=\"https://meet.existsolutions.com/workshop\">meeting room</a>.</p>\n",
      "date_published": "2021-03-08T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-to-zenodo/",
      "url": "https://e-editiones.org/posts/tei-to-zenodo/",
      "title": "TEI2Zenodo",
      "content_html": "<h1 id=\"2021-03-30%2C-17.00-cest-versioning-and-archiving-data%3A-tei2zenodo\" tabindex=\"-1\">2021-03-30, 17.00 CEST <em>Versioning and Archiving Data: TEI2Zenodo</em></h1>\n<p>Dr. Andreas Wagner, Digital Humanities, Max Planck Institute for Legal History and Legal Theory, Frankfurt</p>\n<p>How can I get Persistent Identifiers for the works of my digital edition? How can I deposit their TEI XML sources at a long-time archival repository? And how can I do all this when I don't have an affiliated institution/library taking care of it all? It's in response to questions as these that the &quot;TEI2Zenodo&quot;-Service offers a software (and, for the time being, a platform) that can facilitate archival and sustainable citation of your data. This workshop will introduce the platforms github and zenodo, and discuss the roles that they can play in such an endeavour. We will see and experiment with configurations for various ways of connecting them, particularly ones making use of the TEI2Zenodo service. After the workshop, participants should be capable of sustainably depositing the data of their digital edition, taking profit of free and open services and platforms.</p>\n<p>The workshop is <strong>free</strong>. A registration is not required. Just join the <a href=\"https://meet.existsolutions.com/workshop\">meeting room</a>.</p>\n",
      "date_published": "2021-03-02T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/save-the-dates/",
      "url": "https://e-editiones.org/posts/save-the-dates/",
      "title": "Save the dates",
      "content_html": "<p>New e-editiones events are coming up. Please save the dates:</p>\n<h2 id=\"1st-march-2021%2C-17.00-cet%3A-assembly\" tabindex=\"-1\">1st March 2021, 17.00 CET: Assembly</h2>\n<ul>\n<li>Assembly of e-editiones (members only)</li>\n</ul>\n<h2 id=\"8th-march-2021%2C-17.00-cet%3A-beginners-workshop\" tabindex=\"-1\">8th March 2021, 17.00 CET: Beginners Workshop</h2>\n<ul>\n<li>A Gentle Introduction to Git (Joseph Wicentowski)</li>\n<li>Workflows for TEI Editing and App Development (Wolfgang Meier)</li>\n</ul>\n<p>A recording is available on the <a href=\"https://t.co/hZ5ELCTrJd\">e-editiones youtube channel</a>.</p>\n<h2 id=\"30th-march-2021%2C-17.00-cet%3A-workshop\" tabindex=\"-1\">30th March 2021, 17.00 CET: Workshop</h2>\n<ul>\n<li>Versioning and Archiving Data: TEI2Zenodo (Dr. Andreas Wagner, Digital Humanities Max Planck Institute for Legal History and Legal Theory, Frankfurt)</li>\n</ul>\n<p>All events are <strong>free</strong>. A registration is not required. Just join the <a href=\"https://meet.existsolutions.com/workshop\">meeting room</a>.</p>\n",
      "date_published": "2021-02-02T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/newsletter-2021-1/",
      "url": "https://e-editiones.org/posts/newsletter-2021-1/",
      "title": "Newsletter 21/1",
      "content_html": "<figure><img src=\"https://e-editiones.org/img/bank-phrom-Tzm3Oyu_6sk-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@bank_phrom?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Bank Phrom</a> on <a href=\"https://unsplash.com/s/photos/news?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>We're happy to send our first newsletter covering the past year of activities and developments within e-editiones and would like to encourage institutions or individuals who are not yet members to <a href=\"https://e-editiones.org/how-to-become-a-member/\">join forces</a>.</p>\n<h2 id=\"e-editiones-as-a-society\" tabindex=\"-1\">e-editiones as a Society</h2>\n<p>The e-editiones society was founded on 4 May 2020 by more than 20 international partners. Our institutional members are academies, archives and libraries, edition projects and their sponsors, as well as companies. Among individual members we are proud to count archivists, librarians, editors, researchers from the (digital) humanities, and software developers. After our first attempt to obtain a non-profit association status from the St. Gallen tax office failed, e-editiones was recognized as a non-profit association with tax exemption, following an amendment to the statutes (5th November 2020). A huge thanks to the Karl Barth Foundation for generously sponsoring the necessary legal advice. Building on these foundations and developments and events listed below, our still young society is off to a great start. We hope to broaden the community and increase our membership in 2021.</p>\n<h3 id=\"more-information\" tabindex=\"-1\">More Information</h3>\n<ul>\n<li><a href=\"https://e-editiones.org/members/\">Current list of members</a></li>\n<li><a href=\"https://e-editiones.org/statuten-des-vereins-e-editiones-german/\">Statutes (in German)</a></li>\n<li><a href=\"https://e-editiones.org/how-to-become-a-member/\">How to become a member</a></li>\n</ul>\n<h2 id=\"2020-events\" tabindex=\"-1\">2020 Events</h2>\n<p>e-editiones organized various meetings and workshops in 2020 for members and the wider community to get to know each other and exchange ideas.</p>\n<p><em>Meetings</em></p>\n<ul>\n<li>04.05.2020: Virtual foundation of e-editions and first community event for members</li>\n<li>18.05.2020: First Public Community Event: Presentation of e-editiones by Andreas Kränzle with a short introduction to TEI Publisher for digital editions by Wolfgang Meier, discussion moderated by Joe Wicentowski <a href=\"https://youtu.be/LNbuyeh-vew\">Video</a></li>\n<li>20.10.2020: TEI «Vanilla» by Magdalena Turska <a href=\"https://e-editiones.org/tei-vanilla-meeting-summary/\">Report</a></li>\n</ul>\n<p><em>Workshops</em></p>\n<ul>\n<li>Three-part online Course: <a href=\"https://e-editiones.org/getting-started/\">Learn TEI Publisher by Wolfgang Meier</a>\n<ul>\n<li>Learn TEI Publisher 1: «Stay Home Learn TEI Publisher From Scratch» , 8th Jun 2020 <a href=\"https://www.youtube.com/watch?v=5qu94bhftpk\">Video</a></li>\n<li>Learn TEI Publisher 2, 15th Jun 2020 <a href=\"https://www.youtube.com/watch?v=5qu94bhftpk\">Video</a></li>\n<li>Learn TEI Publisher 3, 22nd Jun 2020 <a href=\"https://www.youtube.com/watch?v=FS36nYFlTbE\">Video</a></li>\n</ul>\n</li>\n<li>Music is in the air – MEI and TEI Publisher by Giuliano Di Bacco and Dennis Ried, 8th Jul 2020 <a href=\"https://e-editiones.org/wp-content/uploads/2020/07/MEI_4_GDB_DR.pdf\">Video</a></li>\n<li>Common eXist-db/TEI Publisher. Deployment Scenarios by Olaf Schreck and Lars Windauer covers different deployment scenarios of eXist-db and TEI Publisher, 9th Sep 2020 <a href=\"https://youtu.be/sA7H2f6zKmI\">Video</a></li>\n<li>Open Source Advent: Presentation of a number of open source developments, 11th – 31st Dec 2020 <a href=\"https://e-editiones.org/osa20/\">Link</a></li>\n</ul>\n<h3 id=\"more-information-1\" tabindex=\"-1\">More Information</h3>\n<ul>\n<li><a href=\"https://www.youtube.com/channel/UCAPhSZdBwFRCEFWNNYOC4Ww\">e-editiones-YouTube-Channel</a></li>\n<li><a href=\"https://e-editiones.org/blog/\">e-editiones blog</a></li>\n</ul>\n<h2 id=\"communication\" tabindex=\"-1\">Communication</h2>\n<p>The association immediately set up communication facilities for its members and the community. For technical questions about TEI Publisher, the central communication channel is <a href=\"https://e-editiones.slack.com/shared_invite/zt-e19jc03q-OFaVni~_lh6emSHen6pswg#/\">Slack</a>. Recurring issues and questions are incorporated into the new <a href=\"https://faq.teipublisher.com/\">FAQ</a> page. For announcements and important messages, we use <a href=\"https://twitter.com/EEditiones\">Twitter</a>. Follow us!</p>\n<h3 id=\"more-information-2\" tabindex=\"-1\">More Information</h3>\n<ul>\n<li><a href=\"https://e-editiones.slack.com/shared_invite/zt-e19jc03q-OFaVni~_lh6emSHen6pswg#/\">e-editiones workspace on Slack</a></li>\n<li><a href=\"https://faq.teipublisher.com/\">TEI Publisher FAQ</a></li>\n<li><a href=\"https://twitter.com/EEditiones\">e-editiones.org on Twitter</a></li>\n<li>Up-to-date list of <a href=\"https://e-editiones.org/get-in-touch/\">e-editiones communication channels</a></li>\n</ul>\n<figure><img src=\"https://e-editiones.org/img/wordcloud-eeditiones-2021.png\" alt=\"\" /></figure>\n<h2 id=\"tei-publisher-developments%3A-versions-6-and-7\" tabindex=\"-1\">TEI Publisher Developments: Versions 6 and 7</h2>\n<p>In 2020 two major versions of TEI Publisher were released: versions 6 and 7. The plan for these versions was born during a meeting in Basel in November 2019, when several Swiss edition projects using TEI Publisher came together to discuss how the software could be developed into an even more sustainable platform. A number of them later became founding members of e-editiones. Their primary goal was to enable institutions to manage and maintain a larger number of editions, either on the same or several servers. To reduce maintenance costs, keeping editions up to date with newer TEI Publisher versions needed to be as simple as possible. Editions relying on different versions needed to be able to run alongside each other.</p>\n<p>Two areas had to be addressed to achieve these goals:</p>\n<ol>\n<li>On the <strong>client side</strong> TEI Publisher was already a collection of small, modular web components, which together formed the user interface. These components had to be extracted into a separate library, so projects could benefit from bug fixes and new components without having to update the rest of the edition's application.</li>\n<li>On the <strong>server side</strong> TEI Publisher needed a well defined API. Such an API would provide a standardized communication channel, through which the web components on the client could talk to the server. To accommodate future updates and support backwards compatibility, the API would need to be versioned, ensuring that both sides could speak the same language.</li>\n</ol>\n<p>Fortunately the <em>Swiss Nationale Infrastruktur für Editionen – Infrastructure nationale pour les éditions</em> agreed to support the outlined ideas, funding a substantial part of the work.</p>\n<p>With the release of TEI Publisher 7, both areas mentioned above have been addressed and the goal has been fully reached.</p>\n<p>Contributions also came from member institutions: the Collection of Swiss Law Sources Online and the St. Galler Missiven were built on an early version of TEI Publisher 4. Both funded a major update of their code to version 7. A number of regressions and new bugs were encountered during the migration, and appropriate fixes were contributed back into the TEI Publisher code base.</p>\n<p>The Karl Barth Gesamtausgabe likewise served as a test bed during TEI Publisher 7 development. Furthermore, the Karl Barth project financed the Microsoft Word to TEI transformation, which is now part of TEI Publisher.</p>\n<p>The source code of TEI Publisher and its related repositories have been moved under the roof of e-editiones and are hosted within <a href=\"https://github.com/eeditiones\">its GitHub organization</a>.</p>\n<h2 id=\"other-software-packages\" tabindex=\"-1\">Other Software Packages</h2>\n<p>Beyond TEI Publisher itself, e-editiones released a number of other software packages:</p>\n<ul>\n<li>The Open API routing library at the heart of TEI Publisher 7, called <a href=\"https://e-editiones.org/roaster-an-open-api-router-for-exist/\">Roaster</a>, proved to be useful even outside the humanities and has already been adopted by a project in the medical realm.</li>\n<li>Born out of the Karl Barth Gesamtausgabe, e-editiones published an <a href=\"https://e-editiones.org/vscode/\">extension for the Visual Studio Code editor</a> to help editors work on TEI. This includes an entity explorer to help with the markup of entities in a text by querying external authority databases from within the XML editor.</li>\n<li>The <a href=\"https://e-editiones.org/cross-search/\">Cross Search</a> package provides a blueprint for a portal incorporating multiple editions, supporting cross-edition search facilities. This will become the basis for future hosting services.</li>\n</ul>\n<h2 id=\"community-contributions\" tabindex=\"-1\">Community Contributions</h2>\n<p>Last but not least, we would like to point out the many contributions we received with respect to translations: TEI Publisher has now been translated to more than 20 languages!</p>\n<p>We hope to see similar interest in other areas, e.g., the newly established <a href=\"https://faq.teipublisher.com/\">FAQ website</a>. We would like to encourage everyone to add entries and turn this into a knowledge base for all users. It already hosts questions and answers concerning encoding, workflows, or best practice recommendations.</p>\n<h2 id=\"the-future\" tabindex=\"-1\">The Future</h2>\n<p>Continuing our cooperative development model, the following new components and features are scheduled to appear in the forthcoming minor version of TEI Publisher:</p>\n<ul>\n<li>A component for displaying mathematical formulae, sponsored by the Bernoulli project (Uni Basel).</li>\n<li>A feature to automatically register persistent DOI identifiers with every resource uploaded to TEI Publisher (financed by the DIPF).</li>\n</ul>\n<p>e-editiones is actively apply for funding: a first proposal has been sent to a Swiss foundation, and we're waiting for feedback. The features we hope to obtain sponsorship for include:</p>\n<ul>\n<li>Better navigation within an edition by allowing arbitrary identification schemes for resources.</li>\n<li>Speaking and bookmarkable URLs.</li>\n<li>Improved accessibility.</li>\n<li>A timeline component.</li>\n<li>Components to improve the editorial workflow:\n<ul>\n<li>Git integration into the user interface for synchronization.</li>\n<li>An annotation feature allowing editions to perform semantic markup tasks directly on the rendered text.</li>\n</ul>\n</li>\n</ul>\n<p>If you have other features on your list, please do not hesitate to propose them. We can achieve more at lower costs if we all work together. If you need a certain feature and plan to apply for funding, why not ask other projects which may have similar requirements? e-editiones is a welcoming umbrella under which your project can come together with other projects from different academic disciplines, coordinate needs, and potentially convince funding agencies to look beyond the perspective of a single project.</p>\n",
      "date_published": "2021-02-02T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/roaster-an-open-api-router-for-exist/",
      "url": "https://e-editiones.org/posts/roaster-an-open-api-router-for-exist/",
      "title": "Roaster: an Open API Router for eXist",
      "content_html": "<p><img src=\"https://e-editiones.org/wp-content/uploads/2021/01/icon.svg\" alt=\"\" title=\"roaster logo\" class=\"left\" width=\"220\" />\nWe're happy to announce that the request routing library, which was originally developed for TEI Publisher 7, has been released as a <a href=\"https://github.com/eeditiones/roaster\">separate package</a> with extended functionality. The library, called <strong>roaster</strong>, is generic and can be used for any eXist-based project. It implements the Open API 3.0 standard to support well-documented, versioned and formally specified APIs.</p>\n<h2 id=\"background\" tabindex=\"-1\">Background</h2>\n<p>In previous versions of TEI Publisher, clients (i.e. your web browser) would communicate with the server by directly calling a variety of XQuery scripts. The server-side API, if you can even call it one, was thus scattered over many different files. Finding your way through the code, figuring out what parameters are expected or how the response should look like was rather difficult. Overwriting the default behaviour - e.g. to replace the generated table of contents - required substantial coding skills. The scripts also changed between TEI Publisher versions. So, if you were working on a standalone edition generated from Publisher, updates could be tricky.</p>\n<p>With TEI Publisher 7, the entire server-side API can be viewed on a single documentation page. It clearly describes the URL paths you can use, as well as any parameter you can pass in and the type it should conform to. One can also see the different possible responses and what kind of content they would return.</p>\n<h2 id=\"the-new-api\" tabindex=\"-1\">The new API</h2>\n<p>Looking at the first route of the <em>documents</em> section <a href=\"https://teipublisher.com/exist/apps/tei-publisher/api.html\" title=\"in the API\">in the API</a> (see screenshot below), it is easy to construct a URL which returns the source XML: the path template to use is <code>/api/document/{id}</code> and <code>{id}</code> should contain the path to a document - relative to the data root of TEI Publisher.</p>\n<figure><img src=\"https://e-editiones.org/img/documents-1024x359.png\" alt=\"\" /><figcaption>Documents API screenshot</figcaption></figure>\n<p>So to retrieve the TEI/XML for <em>Graves' letter</em>, located in the file path <code>test/graves6.xml</code>, we can use the following URL:</p>\n<p><a href=\"https://teipublisher.com/exist/apps/tei-publisher/api/document/test%2Fgraves6.xml\">https://teipublisher.com/exist/apps/tei-publisher/api/document/test%2Fgraves6.xml</a></p>\n<p>Note that the / in the path needs to be URL encoded with <code>%2F</code>. This is a requirement of the Open API specification.</p>\n<p>If instead of the TEI/XML we would like to see the letter rendered to HTML, we can use the third route in the list and simply add <code>/html</code> to the end of the URL:</p>\n<p><a href=\"https://teipublisher.com/exist/apps/tei-publisher/api/document/test%2Fgraves6.xml/html\">https://teipublisher.com/exist/apps/tei-publisher/api/document/test%2Fgraves6.xml/html</a></p>\n<p>or if we prefer a PDF:</p>\n<p><a href=\"https://teipublisher.com/exist/apps/tei-publisher/api/document/test%2Fgraves6.xml/pdf\">https://teipublisher.com/exist/apps/tei-publisher/api/document/test%2Fgraves6.xml/pdf</a></p>\n<p>For sure, as an ordinary user, you don't need to know any of this: using the web interface of TEI Publisher, the web components on the page take care of constructing and calling above URLs for you. But if you are a developer, having a well-defined API is a game changer. Just imagine that you want to support your co-workers with a script which allows them to preview a local TEI document as HTML on the fly: sending the content of the document with an HTTP POST request to <code>/api/preview</code> is all you need! Our <a href=\"https://e-editiones.org/vscode/\">Visual Studio Code plugin</a> does it like this.</p>\n<p>You can use any script or programming language you like, say bash, python, perl - you name it. And because Open API is a widely used standard, there are <a href=\"https://openapi.tools/\">plenty of tools</a> for documentation, testing or code generation. The API documentation page in TEI Publisher is generated by such a tool (<a href=\"https://swagger.io/tools/swagger-ui/\">Swagger UI</a>).</p>\n<h2 id=\"implementation\" tabindex=\"-1\">Implementation</h2>\n<p><strong>roaster</strong> is essentially an implementation of the Open API standard in pure XQuery. It reads the formal API specification (in JSON format) and determines for each HTTP request coming in, which route to take. It will also check if the parameters, headers or request bodies passed in comply to the rules given in the definition of the route. An error will be generated if the request is not in compliance with the definition, e.g. because a required parameter is missing or has a wrong type. It can also fill in default values for parameters, enforce correct content types for the response etc.</p>\n<p>From a developer perspective, this means you don't have to worry about parameters. Your handler function will receive a single parameter, containing all the necessary information about the request and you can safely assume that it complies with the spec you provided.</p>\n<p>If you are interested in the details, please refer to the <a href=\"https://github.com/eeditiones/roaster\">README</a>. For a TEI Publisher-related example, check out the <a href=\"https://faq.teipublisher.com/templates/custom-toc/\">FAQ article</a>, which describes how to replace the default table of contents with a custom one.</p>\n<p>Roaster 1.0.0 can be installed into your local eXist via the package manager in the dashboard. TEI Publisher 7 shipped with a slightly older version, 0.5.1., but you can run both versions side by side.</p>\n",
      "date_published": "2021-01-08T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/cross-search/",
      "url": "https://e-editiones.org/posts/cross-search/",
      "title": "Cross search",
      "content_html": "<p>With a growing number of editions realized with the TEI Publisher it is a logical next step to wish for a search service which can run queries across multiple corpora at the same time.</p>\n<p>Usually the problem to solve would be the great diversity of encoding across projects, even if they all use TEI as a vocabulary of choice. Even commonly represented information, like the language of the source document, can be stored in various locations in a TEI document. Lucene-based fields and facets, introduced in eXist-db 5.0 provide a mechanism to smoothly abstract away these encoding differences - we can just define, say, a <em>language</em> facet and it's the collection index configuration's role to take care of specifying where exactly to grab data from.</p>\n<p>The next potential issue would be actually running the queries across corpora, particularly with the decentralized infrastructure where editions are hosted on diverse servers. The answer here is to define an API which individual editions need to expose, so that the aggregate search engine can just poll all its registered 'members', regardless of their location or how they implement the search internally.</p>\n<figure><img src=\"https://e-editiones.org/img/cross-results-1024x914.png\" alt=\"\" /><figcaption>Cross-search results page</figcaption></figure>\n<p>The <a href=\"https://teipublisher.com/exist/apps/cross-search/index.html\">cross-search</a> prototype is exactly such a search engine. With a simple configuration one can register all 'member' editions. Only requirement for the editions themselves is that they expose the <code>api/search/document</code> API endpoint, which is a matter of simple customization for all TEI Publisher 7 applications which support Open API specifications out of the box. The <code>api/search/document</code> endpoint must accept a number of parameters defined in the specification. For this prototype the title, author and lang(uage) fields as well as genre, language and corpus facets were assumed.</p>\n<p>We are very happy to report that our prototype works really well as a proof of concept with the eclectic collection of documents from TEI Publisher demo apps, all originating with vastly different projects with diverse encoding styles. Next, we intend to extend this idea into a general portal for archives and libraries and we would welcome collaboration from such institutions.</p>\n<p>Our sincere thanks go to the <a href=\"http://https//bbf.dipf.de/en\">Bibliothek für Bildungsgeschichtliche Forschung des DIPF / Research Library for the History of Education at DIPF</a> for supporting this project.</p>\n",
      "date_published": "2020-12-23T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/osa20/",
      "url": "https://e-editiones.org/posts/osa20/",
      "title": "Open Source Advent",
      "content_html": "<p>Through December we're aiming to present a number of recent open source developments related to e-editiones mission to empower digital editions of cultural, scientific, and artistic works by promoting open standards related to digital editions and advancing open source applications based on them.</p>\n<figure><img src=\"https://e-editiones.org/img/open-source-advent-1-816x1024.jpg\" alt=\"\" /></figure>\n<p>Trying to create the atmosphere of joyful expectation and bring some holiday cheer to the dark hours of corona winter, we'll only reveal one &quot;present&quot; at a time and adjust the calendar and this post as we go along.</p>\n<p>In the first instance we are presenting projects coordinated by e-editiones and its members. We certainly hope to see others joining the fun - please use the #OSA20 hashtag on Twitter and let us know so we can update the list.</p>\n<hr />\n<h2 id=\"list-of-%23osa20-presents-in-december\" tabindex=\"-1\">List of #OSA20 presents in December</h2>\n<ul>\n<li>Dec 11th: <a href=\"https://e-editiones.org/vscode/\" title=\"Visual Studio Code plugin\">Visual Studio Code</a> plugin</li>\n<li>Dec 18th: <a href=\"https://e-editiones.org/tei-publisher-7-final/\" title=\"TEI Publisher 7\">TEI Publisher 7</a> release</li>\n<li>Dec 21st: <a href=\"https://faq.teipublisher.com/\" title=\"TEI Publisher FAQ\">TEI Publisher FAQ</a> launch</li>\n<li>Dec 23rd <a href=\"https://teipublisher.com/exist/apps/cross-search/index.html\">Cross search</a></li>\n<li>Dec 31st <a href=\"https://teipublisher.com/exist/apps/eltec/index.html\">ELTeC: European Literary Corpus</a></li>\n</ul>\n",
      "date_published": "2020-12-21T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-publisher-7-final/",
      "url": "https://e-editiones.org/posts/tei-publisher-7-final/",
      "title": "TEI Publisher 7: an example of collaborative development",
      "content_html": "<p>We're happy to announce the final release of TEI Publisher 7. This is the second release coordinated by e-editiones and another important step to improve interoperability, sustainability and long-term maintenance of editions created with TEI Publisher. While release 6 came with a major redesign of the client side parts of TEI Publisher, version 7 focusses on the server, featuring a clean and extensible API based on the Open API standard.</p>\n<figure><img src=\"https://e-editiones.org/img/marcel-eberle-_Z5ayVBcYjg-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@marcel_eberle?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Marcel Eberle</a> on <a href=\"https://unsplash.com/s/photos/seven?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>The plan for TEI Publisher 7 (and 6 before) was born during a meeting in Basel in November last year, when some of the Swiss edition projects using TEI Publisher came together to discuss how the software could be developed into an even more sustainable platform. Many of them became founding members of e-editiones a few months later.</p>\n<p>Fortunately the <a href=\"https://www.nie-ine.ch/\">Swiss Nationale Infrastruktur für Editionen - Infrastructure nationale pour les éditions</a> agreed to support the outlined ideas, funding a substantial part of the work. Other member projects contributed time and money, and served as testbeds for the new versions.</p>\n<p>TEI Publisher 7 is thus more than just another technological milestone - it is the product of a cooperative development model in which users, researchers, institutions and developers work hand in hand towards a shared goal.</p>\n<p>We're looking forward to continue this success story next year and would again like to invite everybody to become part of it. Support the common cause by becoming a member, convince your institutions to take part, and contribute in one of the many possible ways.</p>\n<p>Read the full release notes on the <a href=\"https://teipublisher.com/exist/apps/tei-publisher/doc/blog/tei-publisher-700.xml\">TEI Publisher website</a>.</p>\n",
      "date_published": "2020-12-18T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/vscode/",
      "url": "https://e-editiones.org/posts/vscode/",
      "title": "New Visual Studio Code extension for TEI Publisher",
      "content_html": "<p>Enhancing TEI documents with semantic markup, i.e. encode places, people or terms, can be a time consuming and tedious task. For the Karl Barth edition project, we have thus created a new extension for Visual Studio Code (vscode) and published it as Open Source.</p>\n<h2 id=\"where-it-all-started%3A-a-word-plugin\" tabindex=\"-1\">Where it all started: a Word plugin</h2>\n<p>Within the Karl Barth edition, texts to be published in new volumes are encoded in Microsoft Word and transformed to TEI using TEI Publisher's powerful <a href=\"https://teipublisher.com/exist/apps/tei-publisher/test/test.docx.xml\">docx2TEI conversion</a> feature based on the TEI processing model.</p>\n<p>To simplify semantic encoding, eXist Solutions created a <strong>Word plugin</strong> for the project, which allows editors to easily encode entities occurring within the text: select a string representing an entity, click a button and the plugin will run a query against the database of the Karl Barth Gesamtausgabe, showing potential matches for each possible category.</p>\n<p>With another click, the selected entity is inserted into the Word document, including a reference to the entity in the database. This proved to be a huge timesaver: what took minutes before - switching to a different window, doing a search and copying the ID - is now done in seconds. A screenshot of the Word plugin is shown below:</p>\n<figure><img src=\"https://e-editiones.org/img/word.png\" alt=\"\" /><figcaption>MS Word screenshot</figcaption></figure>\n<p>The plugin also allows editors to get a preview of how the current text would look like in TEI and how it would be rendered to HTML by TEI Publisher's ODD-based transformations. The preview feature sends the underlying Word XML to a TEI Publisher instance, which transforms it first to TEI, and then - if requested - to HTML. Editors can thus see the text as it would later appear on the website.</p>\n<h2 id=\"porting-it-to-visual-studio-code\" tabindex=\"-1\">Porting it to Visual Studio Code</h2>\n<p>However, the Word-workflow only covers the new volumes: we still have 54 already published volumes in TEI, which need to be extended. Parts of this is done automatically (via entity detection), but there's still a lot of manual editing involved. Thus the question arised if the Word plugin could be ported to an XML editor.</p>\n<p>For sure, oXygen would have been the obvious choice, but since the Word Plugin was already written in javascript/typescript, we decided to give Visual Studio Code a try. It turned out to be rather straightforward and the first usable version was done within one evening. Thrilled by the success, we invested two more days to make the plugin more generic, in particular, add connectors for other authority databases. Beyond the Karl Barth Gesamtausgabe, we now have connectors for the German GND, metagrid, Geonames and Google places.</p>\n<figure><img src=\"https://e-editiones.org/img/screen-entity.gif\" alt=\"\" /><figcaption>Enity lookup screencast</figcaption></figure>\n<p>The TEI snippet to be inserted for each of the entity types can be configured in the settings. For example, you could replace <code>&lt;persName&gt;</code> with <code>&lt;name type=&quot;person&quot;&gt;</code> if you like.</p>\n<h2 id=\"previews\" tabindex=\"-1\">Previews</h2>\n<p>The HTML preview feature has been ported as well: pressing a keyboard shortcut or clicking the toolbar icon will present you with a list of ODDs available for transformations, and then open a new editor panel showing the transformation result in HTML. All you need is a TEI Publisher 7 instance which has a matching ODD installed. The plugin uses the general API introduced with TEI Publisher 7, which will also be exposed automatically by any application generated from it.</p>\n<figure><img src=\"https://e-editiones.org/img/screen-preview.gif\" alt=\"\" /><figcaption>HTML preview screencast</figcaption></figure>\n<h2 id=\"snippets\" tabindex=\"-1\">Snippets</h2>\n<p>Finally, it is rather straightforward to create reusable snippets in vscode. To start with, we implemented the one shortcut we use most in oXygen and miss everywhere else: wrap the current selection with an element (the Scholarly XML extension described below also has this, but it doesn't hurt to have it twice in case you're not using that).</p>\n<p>And since we have to encode a lot of foreign texts, we also added one for <code>&lt;foreign&gt;</code>. Doing more would be easy: maybe you have some suggestions? Just write them into our <a href=\"https://github.com/eeditiones/tei-publisher-vscode/issues\">github issues</a>.</p>\n<h2 id=\"combine-with-other-extensions\" tabindex=\"-1\">Combine with other extensions</h2>\n<p>If you combine this with other extensions available on the vscode marketplace, you get rather decent XML editing support - not as sophisticated as with oXygen, but good enough for some serious work.</p>\n<p>For schema-based validation and context sensitive suggestions one can choose between two extensions: <a href=\"https://marketplace.visualstudio.com/items?itemName=raffazizzi.sxml\">Scholary XML</a> is lightweight and provides nice suggestions with documentation. It only understands relax-ng though and does not support catalogs, which means you need to reference the schema via a processing instruction in every TEI file. The second option, <a href=\"https://marketplace.visualstudio.com/items?itemName=redhat.vscode-xml\">XML Language Support by Red Hat</a>, supports XML schema and catalogs, which you can use to associate the TEI namespace with a schema once and for all. On the downside, it uses more system resources as it starts a background Java process.</p>\n<p>To set up a catalog, just create a file <code>catalog.xml</code> somewhere with e.g. the following content and change the vscode configuration property <code>xml.catalogs</code> to point to it:</p>\n<pre class=\"language-xml\"><code class=\"language-xml\"><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>catalog</span> <span class=\"token attr-name\">xmlns</span><span class=\"token attr-value\"><span class=\"token punctuation attr-equals\">=</span><span class=\"token punctuation\">\"</span>urn:oasis:names:tc:entity:xmlns:xml:catalog<span class=\"token punctuation\">\"</span></span><span class=\"token punctuation\">></span></span><br />  <span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;</span>uri</span><br />      <span class=\"token attr-name\">name</span><span class=\"token attr-value\"><span class=\"token punctuation attr-equals\">=</span><span class=\"token punctuation\">\"</span>http://www.tei-c.org/ns/1.0<span class=\"token punctuation\">\"</span></span><br />      <span class=\"token attr-name\">uri</span><span class=\"token attr-value\"><span class=\"token punctuation attr-equals\">=</span><span class=\"token punctuation\">\"</span>https://tei-c.org/Vault/P5/current/xml/tei/custom/schema/xsd/tei_all.xsd<span class=\"token punctuation\">\"</span></span> <span class=\"token punctuation\">/></span></span><br /><span class=\"token tag\"><span class=\"token tag\"><span class=\"token punctuation\">&lt;/</span>catalog</span><span class=\"token punctuation\">></span></span></code></pre>\n<p>Finally, if you use TEI Publisher as a basis for your own editions, you definitely want to install the <a href=\"https://marketplace.visualstudio.com/items?itemName=eXist-db.existdb-vscode\">Language Server and Client for XQuery/eXistdb</a>. It supports working on XQuery files, syncing your local changes with the database, installing XAR files and more.</p>\n<h2 id=\"get-it\" tabindex=\"-1\">Get it</h2>\n<p>The extension is available from Microsoft's <a href=\"https://marketplace.visualstudio.com/items?itemName=e-editiones.tei-publisher-vscode\">Visual Studio Marketplace</a>. To install it in your own Visual Studio Code, just open the <em>Extensions</em> tab and search for <code>tei-publisher-vscode</code>.</p>\n<p>All source code is available on the <a href=\"https://github.com/eeditiones/tei-publisher-vscode\">e-editiones github</a> and we would like to invite others to further extend it, e.g. by adding connectors to other authority APIs. Connectors are simple javascript/typescript classes with just two methods. See the <a href=\"https://github.com/eeditiones/tei-publisher-vscode/tree/master/src/connectors\">existing connectors</a> for inspiration.</p>\n<p>If you have questions, suggestions or would like to discuss further extensions: you'll find us in the <a href=\"https://e-editiones.org/get-in-touch/\">e-editiones slack</a> rooms.</p>\n",
      "date_published": "2020-12-09T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-vanilla-meeting-summary/",
      "url": "https://e-editiones.org/posts/tei-vanilla-meeting-summary/",
      "title": "TEI &quot;Vanilla&quot; meeting summary",
      "content_html": "<p>Following the spontaneous exchange on <a href=\"https://join.slack.com/t/e-editiones/shared_invite/zt-e19jc03q-OFaVni~_lh6emSHen6pswg\">e-editiones Slack</a> channel, we have held an online community meeting to discuss the emerging TEI Vanilla proposal on October 20th. It was a pleasure to see such a broad interest and diverse representation of participants, spanning the entire range from TEI newcomers to current and former TEI Council and Board members.</p>\n<p>Main motivation for what Martin Mueller and I initially codenamed TEI Vanilla were recurring voices expressing frustration of starting a TEI project. Without previous experience with this extensive and robust vocabulary the learning curve may be quite steep and the whole process overwhelming. During the meeting we had a chance to hear many opinions on history, theory, practice and local circumstances of conducting a TEI project. These voices cannot be easily reconciled but form an excellent base for further discussion.</p>\n<p>Nevertheless, there was a shared agreement on certain shortcomings in the availability of:</p>\n<ul>\n<li>introductory and advanced material for self-study</li>\n<li>curated repository of extensive examples in different languages and covering different domains</li>\n<li>critical commentary focusing on the bigger picture and decision making through the whole process: from encoding to publishing</li>\n</ul>\n<p>Similarly, we agreed during the meeting, that a particular customization tied to a schema, following the path of TEI Lite or TEI Simple is at the moment a secondary concern. Rather a “kleine Katechismus”, presenting main concepts and considerations in a linear progression is sorely missed. Naturally, there’s no single path through the richness of the TEI but we imagine such an introductory guide would embrace the 80/20 approach and focus on issues relevant for virtually all projects.</p>\n<p>All these postulates are not new and there is a lot of diverse material dispersed through the web already. TEI website and wiki pages try to point its user towards projects, tools and tutorials. Nevertheless, these lists, or resources they refer to, are often dated or fragmentary, therefore do not give an adequate overview, particularly of emerging practices.</p>\n<p>It is obvious that gathering and preparing resources helpful for broad spectre of TEI users is a task both daunting as well as never-ending, and can only be undertaken and then maintained within the interested communities of practice themselves. e-editiones society sees its important role in providing a space for publication and coordinating efforts on preparation of guides, tutorials and best practice recommendations for digital editions and would like to invite you to submit proposals for:</p>\n<ul>\n<li>guest blog posts on <a href=\"http://e-editiones.org/\">e-editiones.org</a> covering various aspects of preparing and publishing a digital edition</li>\n<li>TEI-encoded samples for various domains</li>\n<li>accompanying ODD schema and processing model customizations</li>\n</ul>\n<p>You can discuss and <a href=\"https://github.com/eeditiones/tei-vanilla/issues\">submit proposals</a> via TEI Vanilla issue tracker.</p>\n<p>PS We hoped to provide a recording of our online meeting and did not minute it. Unfortunately, due to a technical glitch, the recording quality is insufficient for publication. I am very sorry for this and would like to encourage other participants to share their perspectives, opinions and points for discussion I might have missed in this summary.</p>\n<p>Hoping to hear from you soon,</p>\n<p>Magdalena Turska</p>\n",
      "date_published": "2020-10-30T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-vanilla-a-scoop-of-tei-for-everyone/",
      "url": "https://e-editiones.org/posts/tei-vanilla-a-scoop-of-tei-for-everyone/",
      "title": "TEI Vanilla - a scoop of TEI for everyone",
      "content_html": "<p>Following the spontaneous but inspiring exchange on e-editiones Slack channel, we'd like to invite you to a new e-editiones community meeting to discuss the emerging TEI Vanilla proposal. The event will take place <a href=\"https://meet.existsolutions.com/eeditiones\" title=\"online\">online</a> at 4pm CET on October 20th, 2020.</p>\n<p>Many of us at some point expressed their frustration with starting a TEI project. Without previous experience with this extensive and robust vocabulary the learning curve may be quite steep and the whole process overwhelming.</p>\n<p>TEI Vanilla is a grassroots movement to help newcomers to the TEI community in smooth on-boarding. We feel that a number of prospective users, both individual and institutional, would benefit from a gentler introduction than TEI's excellent but extensive Guidelines provide.</p>\n<p>Vanilla is meant to pick up where earlier 2015 TEI Simple project, led by the late Sebastian Rahtz, Martin Mueller and Brian Pytlik-Zillig, left off. As some of you would remember, main outcome of the TEI Simple was the TEI Processing Model, now lying at the heart of the TEI Publisher. Nevertheless, the other goal envisioned for Simple was creating a schema which would provide a good starting point for majority, if not most, larger scale editorial projects. We based our selection on a survey of usage through large volume corpora, among them EEBO-TCP and DTA, and believed it to be a solid 80/20 solution: addressing 80% of users needs with 20% of the effort and heartache.</p>\n<p>Thanks to the space for discussion on e-editiones Slack we found out there are many like-minded individuals willing to join forces in the work of reviewing the schema and working on its own dedicated Guidelines and a body of examples, tutorials and other auxiliary resources.</p>\n<p>At this point we would like to share our motivations and preliminary goals but above all solicit opinions, perspectives and requirements from our community. <a href=\"https://meet.existsolutions.com/eeditiones\" title=\"Join us\">Join us</a> for the event and share your thoughts on <a href=\"https://join.slack.com/t/e-editiones/shared_invite/zt-e19jc03q-OFaVni~_lh6emSHen6pswg\" title=\"Slack\">Slack</a>.</p>\n",
      "date_published": "2020-10-06T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/common-exist-db-tei-publisher-deployment-scenarios/",
      "url": "https://e-editiones.org/posts/common-exist-db-tei-publisher-deployment-scenarios/",
      "title": "Common eXist-db / TEI Publisher Deployment Scenarios",
      "content_html": "<p>This E-editiones online event covers different scenarios of running eXist-db applications by the example of TEI Publisher. Olaf Schreck and Lars Windauer from eXist Solutions will present the different possibilities and requirements for:</p>\n<ul>\n<li>Editors presenting their TEI documents</li>\n<li>Developers implementing new features</li>\n<li>Sysadmins hosting digital editions in TEI Publisher</li>\n</ul>\n<p>The first part of the event is intended also for the non-technical audience and will provide an overview of the different usage scenarios of TEI Publisher while the second part focuses on setting up and maintaining TEI Publisher for production environments with a focus on the IT automation software <a href=\"https://www.ansible.com/\">Ansible</a>.</p>\n<p>The event took place on Tuesday the 8th of September from 16:00 till 17:00 CEST on Jitsi.</p>\n<ul>\n<li>Slides: <a href=\"https://e-editiones.org/wp-content/uploads/2020/08/Common-eXist-db-TEI-Publisher-Deployment-Scenarios.pdf\">Common-eXist-db-TEI-Publisher-Deployment-Scenarios</a></li>\n<li><a href=\"https://youtu.be/sA7H2f6zKmI\">Workshop Recording</a></li>\n</ul>\n<p>Thanks to <a href=\"https://www.nie-ine.ch/\">NIE-INE</a> for sponsoring this event.</p>\n",
      "date_published": "2020-08-29T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/music-is-in-the-air/",
      "url": "https://e-editiones.org/posts/music-is-in-the-air/",
      "title": "Music is in the air - MEI and TEI Publisher",
      "content_html": "<p>On Wednesday, July 8th we had the opportunity to join another e-editiones online event, this time a session dedicated to MEI (Music Encoding Initiative). Giuliano Di Bacco and Dennis Ried introduced us to MEI and challenges of publishing MEI and MEI-in-TEI collections on the web (<a href=\"https://e-editiones.org/wp-content/uploads/2020/07/MEI_4_GDB_DR.pdf\">see slides</a>). Wolfgang Meier presented early results of his work on integration of MEI into the TEI Publisher.</p>\n<figure><img src=\"https://e-editiones.org/img/marius-masalar-rPOmLGwai2w-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@marius?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Marius Masalar</a> on <a href=\"https://unsplash.com/s/photos/music?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>As we learned from Giuliano's and Dennis' introduction <em>MEI, like the TEI, is an umbrella term which simultaneously describes an organization, a research community, and a markup language</em> (<a href=\"https://music-encoding.org/about/\">music-encoding.org</a>). It's almost 20 years since the first public presentation of the XML schema created by Perry Roland (Univ. of Virginia) for the representation of music notation. Now it has become a thriving community of around 400 members worldwide, specialists from various music research groups, including technologists, librarians, historians, and theorists.</p>\n<p>This open-source effort to define guidelines for encoding musical documents in a machine-readable structure draws in many aspects on TEI: using an ODD metalanguage to define both the schema and encoding guidelines, dividing the document into metadata, facsimile and text parts, recording logical and structural divisions of the document (albeit named differently) or &quot;borrowing&quot; a number of element names from TEI to deal with metadata, textual content, critical apparatus, linking etc.</p>\n<p>Nevertheless, MEI was designed to specialize in the encoding of music documents, therefore MEI data is predominantly about the meaning of the music notation: notes, rests, chords, measures. That said MEI allows for multiple additional layers of annotations:</p>\n<ul>\n<li>about the visual aspects of the notation, and/or of the features of a physical copy of a score</li>\n<li>metadata</li>\n<li>editorial markup</li>\n</ul>\n<p>While MEI encoding allows for sophisticated analysis of various features of the musical piece, rendering of MEI documents often poses a substantial challenge. We need to consider that music notation is a very complex system; actually, many systems were developed since the medieval times, and MEI strives to give a sophisticated representation not only of the symbols but of their meaning and of the logic that brings them together in pieces of music of all ages. However, it is still difficult, if not impossible, to render graphically all the nuances of the encoding.</p>\n<p>Major breakthrough in this respect has been the creation of the <a href=\"https://www.verovio.org/\">Verovio</a> music engraving library which is considered the most advanced solution in the field to generate score visualisations in SVG.</p>\n<p>Verovio is quite helpful to render the notation for the most common use cases for MEI:</p>\n<ul>\n<li>to create transcriptions/editions of music pieces</li>\n<li>to produce bibliographies and catalogs</li>\n</ul>\n<p>Difficulties arise when we need to deal with mixed textual and musical content: from music treatises (<a href=\"http://www.chmtl.indiana.edu/tml\">see Thesaurus Musicarum Latinarum</a>), composers’ letters quoting musical phrases, to opera librettos and listening guides, papers including snippets of music notation (e.g. music textbooks)... Such situations often require the simultaneous use of both TEI and MEI (and for instance a MEI file can be referenced in a TEI document using the `` element). Giuliano and Dennis walked us through a number of different approaches employed in various projects, where tools specialized just for a single vocabulary do not meet their ideal criteria for broad application:</p>\n<ul>\n<li>ease of setting up</li>\n<li>TEI and MEI support</li>\n<li>facsimile integration</li>\n</ul>\n<p>Following this cue, Wolfgang has demonstrated his new <a href=\"https://unpkg.com/@teipublisher/pb-components@1.0.0/dist/api.html#pb-mei.0\">pb-mei</a> web component which uses Verovio under the hood to generate SVG representation of the score. For TEI documents applying `` element to include a pointer to a MEI encoding of a music notation it is very straightforward to adjust the ODD to transform this pointer to a pb-mei component, as demonstrated in the <a href=\"https://unpkg.com/@teipublisher/pb-components@1.0.0/dist/api.html#pb-mei.1\">pb-mei</a> demo.</p>\n<figure><img src=\"https://e-editiones.org/img/mei-demo-1024x523.png\" alt=\"\" /><figcaption>Demo page of the pb-mei component</figcaption></figure>\n<p>This proved to be a very pleasant surprise and a convincing argument that TEI Publisher could be adapted to fit the needs of MEI community. A short discussion followed ranging from detailed questions on MEI encoding, through workflows on creating MEI sources <a href=\"https://editor.verovio.org/\">cf. Verovio editor</a> to information important for preparing an ODD and customization modules for supporting MEI in TEI Publisher. We agreed to work with Giuliano and Dennis on including MEI-in-TEI and pure MEI examples in the next minor version of the TEI Publisher to demonstrate fully its capability.</p>\n<p>We were happy to see that this event gathered the audience of around 17 participants and are looking forward to establishing a monthly meetup online to provide an arena for lively discussions on subjects of interest to the community. Please get in touch if you'd like to discuss a particular topic.</p>\n",
      "date_published": "2020-07-23T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/tei-publisher-6/",
      "url": "https://e-editiones.org/posts/tei-publisher-6/",
      "title": "TEI Publisher 6",
      "content_html": "<p>Today the new TEI Publisher 6.0.0 is finally out. This is a major release introducing the refactored and extended component library as well as numerous bugfixes and new features.</p>\n<figure><img src=\"https://e-editiones.org/img/clem-onojeghuo-H-82Nbe8m7o-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@clemono?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Clem Onojeghuo</a> on <a href=\"https://unsplash.com/s/photos/six?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n<p>All Publisher's web components are now available as a LitElement library distributed via npm. While invisible to users, this redesign greatly improves modularity and simplifies updates of Publisher-based applications. It also facilitates embedding of Publisher custom components into CMS systems (e.g. Hugo or WordPress) and other application frameworks (like angular, vue or react).</p>\n<p>This version also brings extended internationalization and full localization into 19 languages, simplified styling, support for data organization based on subcollections, several new and enhanced components (including one for <a href=\"https://unpkg.com/@teipublisher/pb-components@1.0.0/dist/api.html#pb-mei.1\">notated music</a> encoded in MEI), improved ODD editor and major extension and revision of the documentation.</p>\n<figure><img src=\"https://e-editiones.org/img/mei-demo-1024x523.png\" alt=\"\" /><figcaption>Demo page of the pb-mei component</figcaption></figure>\n<p>More information about this release can be found on the <a href=\"https://teipublisher.com/exist/apps/tei-publisher/doc/blog/tei-publisher-60.xml\">TEI Publisher blog.</a></p>\n<p>A 3-part online course on TEI Publisher 6 has been led by Wolfgang Meier in June 2020. Video recordings of all the sessions, and a walk-through for the assignments are available for <a href=\"https://github.com/eeditiones/workshop\">self-study</a>.</p>\n<p>Our special thanks for supporting this release go to:</p>\n<ul>\n<li>Numerous community members who helped to translate and proofread language files via <a href=\"https://crwd.in/tei-publisher\">Crowdin</a></li>\n<li>Swiss Nationale Infrastruktur für Editionen - Infrastructure nationale pour les éditions for funding a large part of work on the web component refactoring.</li>\n<li>ACE – Austrian Corpora and Editions of the Österreichische Akademie der Wissenschaften for a small grant to enhance toggling mechanisms</li>\n</ul>\n",
      "date_published": "2020-07-10T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/community-event-on-music-encoding/",
      "url": "https://e-editiones.org/posts/community-event-on-music-encoding/",
      "title": "Community Event on Music Encoding",
      "content_html": "<p>We would like to invite all members and non-members of <a href=\"http://e-editiones.org/\">e-editiones.org</a> to another community event on 8th of July, 16:00 CEST (<a href=\"https://www.timeanddate.com/worldclock/fixedtime.html?msg=e-editiones+Community+Event+on+Music+Encoding&amp;iso=20200708T16&amp;p1=37&amp;ah=1\" title=\"check your local time\">check your local time</a>).</p>\n<p>Community members Giuliano Di Bacco and Dennis Ried will give us a lightning introduction to the Music Encoding Initiative (MEI) and its practical use. We'll then have an open conversation about possible integrations of MEI into TEI Publisher. There will be also be room for further discussion in the &quot;any other business&quot; section afterwards. So if you have other topics or questions beyond music encoding, do not hesitate to bring them up.</p>\n<p>Join us on jitsi: <a href=\"https://meet.jit.si/e-editiones-events\">https://meet.jit.si/e-editiones-events</a></p>\n<p>This event will be the first in a series of community meetups we would like to establish on a monthly basis. Looking forward to see you all next week.</p>\n",
      "date_published": "2020-07-03T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/stay-home-learn-tei-publisher-from-scratch-june-2020/",
      "url": "https://e-editiones.org/posts/stay-home-learn-tei-publisher-from-scratch-june-2020/",
      "title": "«Stay Home Learn TEI Publisher From Scratch»",
      "content_html": "<p>«Stay Home Learn TEI Publisher From Scratch» Online Course A 3-part online course: 8th, 15th and 22nd of June 4-5 pm (CEST)</p>\n<p>Find all informations on github:</p>\n<p><a href=\"https://github.com/eeditiones/workshop\">https://github.com/eeditiones/workshop</a></p>\n<figure><img src=\"https://e-editiones.org/img/headway-5QgIuuBxKwM-unsplash.jpg\" alt=\"\" /><figcaption>Photo by <a href=\"https://unsplash.com/@headwayio?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Headway</a> on <a href=\"https://unsplash.com/s/photos/workshop?utm_source=unsplash&utm_medium=referral&utm_content=creditCopyText\" target=\"unsplash\">Unsplash</a></figcaption></figure>\n",
      "date_published": "2020-06-08T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/first-community-event-on-may-18th-2020/",
      "url": "https://e-editiones.org/posts/first-community-event-on-may-18th-2020/",
      "title": "First Community Event on May 18th 2020",
      "content_html": "<h2 id=\"if-you-missed-it-...\" tabindex=\"-1\">If you missed it ...</h2>\n<p>the recorded live stream of our first community event on May 18th 2020 is available on youtube:</p>\n<iframe src=\"https://www.youtube.com/embed/LNbuyeh-vew\" width=\"560\" height=\"315\" frameborder=\"0\" allowfullscreen=\"allowfullscreen\"></iframe>\n",
      "date_published": "2020-05-18T00:00:00Z"
    },{
      "id": "https://e-editiones.org/posts/embeding-tei-publisher-components/",
      "url": "https://e-editiones.org/posts/embeding-tei-publisher-components/",
      "title": "TEI Publisher Components in Wordpress",
      "content_html": "<p>This is a short rewrite of Wolfgang’s post on <a href=\"https://teipublisher.onrender.com/post/embedding-publisher/\">Embedding TEI Publisher Components</a> in <a href=\"https://gohugo.io/\">Hugo</a> . For Wordpress you can do the same thing very easily. I used the example of Wolfgang’s post; just make sure that your site is whitelisted.</p>\n<p>Just install the <a href=\"https://de.wordpress.org/plugins/simple-embed-code/\">Code Embed Plugin</a> and create a <a href=\"https://wordpress.org/support/article/custom-fields/\">custom field</a> <a href=\"https://e-editiones.org/posts/embeding-tei-publisher-components/#fn:1\">1</a> with the name &quot;CODEpbembed&quot; and the value:</p>\n<pre><code>&lt;script src=&quot;https://unpkg.com/@webcomponents/webcomponentsjs@2.4.3/webcomponents-loader.js&quot;&gt;&lt;/script&gt;&lt;script type=&quot;module&quot; src=&quot;https://unpkg.com/@teipublisher/pb-components@latest/dist/pb-components-bundle.js&quot;&gt;&lt;/script&gt;\n</code></pre>\n<p>Then add another custom field with the name &quot;CODEpbkant&quot; and the value:</p>\n<pre><code>&lt;pb-page endpoint=&quot;https://teipublisher.com/exist/apps/tei-publisher&quot; emit=&quot;kant&quot; class=&quot;embedded&quot;&gt;&lt;pb-document id=&quot;kant&quot; path=&quot;test/kant_rvernunft_1781.TEI-P5.xml&quot; odd=&quot;dta&quot;&gt;&lt;/pb-document&gt;&lt;pb-navigation direction=&quot;forward&quot; keyboard=&quot;right&quot; emit=&quot;kant&quot; subscribe=&quot;kant&quot;&gt;&lt;paper-fab icon=&quot;icons:chevron-right&quot;&gt;&lt;/paper-fab&gt;&lt;/pb-navigation&gt;&lt;pb-navigation direction=&quot;backward&quot; keyboard=&quot;left&quot; emit=&quot;kant&quot; subscribe=&quot;kant&quot;&gt;&lt;paper-fab icon=&quot;icons:chevron-left&quot;&gt;&lt;/paper-fab&gt;&lt;/pb-navigation&gt;&lt;pb-view src=&quot;kant&quot; xpath=&quot;//teiHeader/fileDesc/titleStmt/title&quot; emit=&quot;kant&quot; subscribe=&quot;kant&quot;&gt;&lt;pb-param name=&quot;header&quot; value=&quot;short&quot;&gt;&lt;/pb-param&gt;&lt;/pb-view&gt;&lt;pb-view class=&quot;transcription&quot; src=&quot;kant&quot; view=&quot;page&quot; emit=&quot;kant&quot; subscribe=&quot;kant&quot; append-footnotes=&quot;&quot; animation=&quot;&quot;&gt;&lt;/pb-view&gt;&lt;/pb-page&gt;\n</code></pre>\n<p>We add a third custom field with some CSS:</p>\n<pre><code>pb-page {\n    position: relative;\n    padding-top: 10px;\n    border-top: 1px solid #e0e0e0;\n}\n\n.embedded pb-navigation {\n    position: absolute;\n    top: 45%;\n}\n\n.embedded pb-navigation[direction=&quot;forward&quot;] {\n    right: 0;\n}\n\n.nav {\n    height: 40px;\n    padding-bottom: 10px;\n    border-bottom: 1px solid #e0e0e0;\n}\npb-view {\n    margin-left: auto;\n    margin-right: auto;\n}\n.transcription {\n    overflow: auto;\n    display: flex;\n    justify-content: center;\n    height: 400px;\n}\npb-navigation[direction=&quot;forward&quot;] {\n    float: right;\n}\n</code></pre>\n<p>Use the Custom Field like this (without the whitespace between the brackets):</p>\n<pre><code>{ {CODECss}}\n{ {CODEpbembed}}\n{ {CODEpbkant}}\n</code></pre>\n<p>For the facsimilie we use the <code>pb-facsimile</code> Component to integrate a IIIF viewer:</p>\n<pre><code>&lt;pb-facsimile base-uri=&quot;https://apps.existsolutions.com/cantaloupe/iiif/2/&quot; facsimiles=&quot;[&quot;15929_000_IDL5772_BOss12034_IIIp79.jpg&quot;, &quot;15929_000_IDL5772_BOss12034_IIIp80.jpg&quot;, &quot;15929_000_IDL5772_BOss12034_IIIp81.jpg&quot;, &quot;15929_000_IDL5772_BOss12034_IIIp82.jpg&quot;]&quot; default-zoom-level=&quot;0&quot; show-navigator=&quot;show-navigator&quot; show-navigation-control=&quot;show-navigation-control&quot;&gt;&lt;/pb-facsimile&gt;\n</code></pre>\n<hr />\n<ol>\n<li>Custom fields are hidden by default on most WordPress sites. To make them visible, select the Screen Options tab at the top of any WordPress editor page, and choose Custom Fields <a href=\"https://e-editiones.org/posts/embeding-tei-publisher-components/#fnref1:1\">↩</a></li>\n</ol>\n",
      "date_published": "2019-09-07T00:00:00Z"
    }
  ]
}
