{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.16",
    "rootNode": "3.16",
    "id": "webcomponents",
    "odd": "docbook.odd",
    "next": "3.16.9",
    "previous": "3.14.13",
    "nextId": "webcomponents-intro",
    "previousId": "css-styling-external",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"webcomponents\"><pb-observable data=\"3.16,3.16\" emit=\"transcription\"><h1 class=\"tei-title7 title\">Page templates and pb-components</h1><p class=\"tei-para\"> As described earlier, the various sample documents included in the TEI Publisher Demo\n      collection differ not only in the ODD they use, but also concerning the general layout and\n      composition of the page. They are based on different HTML templates, which can be found in the\n        <span class=\"tei-filename code\"> templates/pages</span> collection of the TEI Publisher app. Each template\n      assembles various building blocks in a slightly different way - some <a href=\"/?odd=docbook.odd&amp;view=div&amp;id=selected-use-cases\" class=\"tei-link3\" target=\"\"> examples</a> show a facsimile view next to the text, others\n      a parallel display of transcription andtranslation, some include a map and another showcase\n      collapsible metadata section. Which template is being used is determined by a <a href=\"/?odd=docbook.odd&amp;view=div&amp;id=pi-config\" class=\"tei-link3\" target=\"\">processing instruction</a> in the TEI sources of these examples. </p><p class=\"tei-para\">The building blocks we mentioned are custom HTML elements. Each of them encapsulates a\n      certain functionality and appearance. The map, the facsimile, but also the text view itself\n      and all controls are custom HTML elements. They are like \"Lego\" blocks which can be freely\n      moved around and rearranged without knowing anything about internal implementation of the\n      component.</p></pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}