{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.40.25.30",
    "rootNode": "3.40.25.30",
    "id": null,
    "odd": "docbook.odd",
    "next": "3.40.27",
    "previous": "3.40.25.28",
    "nextId": null,
    "previousId": null,
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\"><pb-observable data=\"3.40.25.30,3.40.25.30\" emit=\"transcription\">\n        <h3 class=\"tei-title7 title\">Batch edits and suggestions</h3>\n        <p class=\"tei-para\">It is not uncommon that the same person will be mentioned multiple times in a document. To simplify and speed up the editing process, the\n          annotation editor tries to detect possible other occurrences of the currently selected entity throughout the document. After selecting an entity from\n          the authority database, a list of potential matches is presented beneath the annotation details.</p>\n        <p class=\"tei-para\">The list is compiled by traversing the text shown on screen, searching for strings\n          which may indicate the same entity. The actual query depends on the information provided\n          authority used: e.g. if the authority supplies alternative names, those will be added to\n          the searched for strings.</p>\n        <p class=\"tei-para\">Each occurrence will show a checkbox to the left. Checking it will immediately tag the corresponding passage as another instance of the same\n          entity. You can also check all boxes at once by clicking on the first icon (the one with double checkmarks) in the toolbar above the list.</p>\n        <p class=\"tei-para\">Moving your mouse over an entry will scroll the text to the corresponding occurrence,\n          showing you the match in its context.</p>\n        <p class=\"tei-para\">Existing annotations referencing the same entity will also be shown in the list - with their checkbox checked. Sometimes you may also see an occurrence\n          marked in red, indicating that this is an existing annotation referencing a different entity, so considered a potential inconsistency to\n          review. You will see such cases additionally underlined with red dots as shown below. In this example, one of the entities marked as \"Oxford\" points to a\n          different record in the authority register. To fix this by applying the currently selected entity, check the item's checkbox.</p>\n        <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n            <span class=\"tei--element\">\n              <img src=\"ann-inconsistency.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n            </span>\n          </span><figcaption>Inconsistency warning</figcaption></figure>\n\n        <p class=\"tei-para\">When working on a broader material, main actors and places will be often mentioned in many documents. \n          It is now possible to detect potential matches across the entire collection and review and apply them individually, or even all at once.\n          To start the search beyond the current document use the magnifying glass icon in the <span class=\"tei-emphasis2\">Occurrences</span> toolbar.\n        </p>\n\n        <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n            <span class=\"tei--element\">\n              <img src=\"ann-corpus.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n            </span>\n          </span><figcaption>Start search through the entire collection</figcaption></figure>\n\n        <p class=\"tei-para\">If matches can be found in other documents, a review panel will pop up, where you can review them \n          on a document-by-document and match-by-match basis. Each document is presented as a separate results page and you \n          can select or deselect occurrences depending where you want annotations to be applied.</p>\n          <p class=\"tei-para\">Similarly to the conventions throughout the annotation editor, color coding is used to highlight existing annotations and potential\n          inconsistencies. Clicking the disk icon will directly merge and save the checked annotations into the current document and remove it from the list of\n          items to review.</p>\n        <p class=\"tei-para\">Alternatively you can click on the file's path in the header: this will open the corresponding document in a new annotation editor in a separate\n          browser tab. The selected annotations will be added to the document for review, but are not merged yet. You need to explicitely save them before\n          closing the additional tab.</p>\n        <p class=\"tei-para\">Note that opening a document for review in an extra tab will also remove it from the list of pending documents in the dialog.</p>\n        <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n            <span class=\"tei--element\">\n              <img src=\"ann-review.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n            </span>\n          </span><figcaption>Review matches across collection</figcaption></figure>\n      </pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}