{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.7.15",
    "rootNode": "3.7.15",
    "id": "odd-experiments",
    "odd": "docbook.odd",
    "next": "3.7.17",
    "previous": "3.7.13",
    "nextId": "upload",
    "previousId": "document-view",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section3\" id=\"odd-experiments\"><pb-observable data=\"3.7.15,3.7.15\" emit=\"transcription\">\n      <h2 class=\"tei-title6 title\">Experimenting with ODDs and page templates</h2>\n      <p class=\"tei-para\">\n        All TEI Publisher's sample documents are TEI XML files which are transformed into a\n          HTML webpage for display in the browser. Two major factors determine how the final page is\n          going to look like: an\n        <span class=\"tei-emphasis1\">ODD</span>\n        and a\n        <span class=\"tei-emphasis1\">page template</span>\n        .\n      </p>\n\n      <p class=\"tei-para\">\n        We have already mentioned in the very first section that the TEI Processing Model lies\n          at the heart of the Publisher - the ODD file associated with a document defines the rules\n          of transformation of the XML source file into HTML. Detailed discussion of the Processing\n          Model can be found in\n        <a href=\"/?odd=docbook.odd&amp;view=div&amp;id=pm-syntax\" class=\"tei-link3\" target=\"\">following chapters</a>\n        , for now it is\n          sufficient to say this is where decisions if a TEI element should be rendered inline, with\n          a tooltip, or as a marginal note, are made. Simplifying things a bit the\n        <span class=\"tei-emphasis2\">text</span>\n        of the document that you see rendered in your browser is an\n          effect of applying the rules from ODD file to the source document.\n      </p>\n      <p class=\"tei-para\">\n        Nevertheless, as we demonstrated in the section on selected sample documents, in the\n          application context we certainly want more than just text, however nicely typeset. From\n          basic navigation controls, table of content, to facsimile display, critical apparatus,\n          glossaries and maps - all of this and much more could be included in the final webpage.\n          Following\n        <span class=\"tei-emphasis2\">divide and conquer</span>\n        approach the TEI Publisher defines such\n          specialized page elements as small, reusable blocks, using the Web Components technology.\n          Components can be used like common HTML elements, thus a page template is just an HTML\n          fragment which organizes the building blocks needed for a specific page.\n      </p>\n      <p class=\"tei-para\">\n        Looking more closely again at the TEI Publisher's\n        <span class=\"tei-guibutton guibutton\">Start</span>\n        page,\n          we can now give more detail what is happening when any of the sample documents is loaded.\n          On the right hand side there is a panel listing all ODD files available. Each of the\n          sample documents includes a processing instruction which specifies default ODD and page\n          template for this document. You can check what they are in\n        <span class=\"tei-guibutton guibutton\">Settings</span>\n        panel. For the Graves letter it would be\n        <span class=\"tei-parameter code\">Graves' Letters</span>\n        ODD and\n        <span class=\"tei-parameter code\">Letter with map/facets</span>\n        template.\n      </p>\n      <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n          <span class=\"tei--element\">\n            <img src=\"odd-page-template-settings.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 512px; \">\n          </span>\n        </span><figcaption>The Settings Panel for the Graves Letter</figcaption></figure>\n      <p class=\"tei-para\">\n        It is easy to experiment with different page templates and ODDs just changing these\n          options in the\n        <span class=\"tei-guibutton guibutton\">Settings</span>\n        panel. An important caveat though is that\n          not every page template makes sense for every document - after all parallel alignment can\n          only be successful if there is something to align, map needs coordinates to display, page\n          view needs information about page breaks and so on.\n      </p>\n    </pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}