{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.37.21.20",
    "rootNode": "3.37.21.20",
    "id": null,
    "odd": "docbook.odd",
    "next": "3.37.21.22",
    "previous": "3.37.21",
    "nextId": null,
    "previousId": null,
    "switchView": null,
    "content": "<!DOCTYPE html>\n<div class=\"content \"><div class=\"tei-section3\"><pb-observable data=\"3.37.21.20,3.37.21.20\" emit=\"transcription\">\n      <h3 class=\"tei-title6 title\">Semantic Annotations</h3>\n      <p class=\"tei-para\">Semantic annotations include markup for entities like people, places or terms. Most editions will try to link those to a description of the entity, either provided by an external authority file or from a local resource. \n        In any case you will want to reference a unique identifier to mark occurrences of the same entity throughout the edition.</p>\n    <p class=\"tei-para\">When choosing a semantic annotation from the toolbar, you will thus see a dialog which runs a query against the authority \n      file configured for the annotation type, e.g. Geonames for places or GND for people.\n       </p>\n       <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n          <span class=\"tei--element\">\n            <img src=\"ann-person.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n          </span>\n        </span><figcaption>Annotating a person</figcaption></figure>\n    <p class=\"tei-para\">The semantic annotation dialog displays the query results for you to choose from and the query sent initially corresponds to \n      the text selection made. Often this may not find the relevant entity, but you can change the query in the input field on top of the dialog \n      and run the search again by pressing enter. Compare the screenshots above and below to note the difference when searching for \n      <span class=\"tei-emphasis2\">William</span> vs <span class=\"tei-emphasis2\">William Graves</span></p>\n      <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n          <span class=\"tei--element\">\n            <img src=\"ann-person2.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n          </span>\n        </span><figcaption>Re-running the query</figcaption></figure>\n    <p class=\"tei-para\">When you use the + sign to select an authority entry, its ID will be copied into the top input field in the left sidebar and a short \n      description of the entity should appear beneath. The ID will be used as reference in the resulting TEI, i.e. it will appear in an attribute \n      attached to e.g. <span class=\"tei-tag code\">persName</span> or other TEI element. The exact mapping between an annotation type and a TEI snippet produced can be freely configured (see below).</p>\n    <p class=\"tei-para\">Semantic annotations are stored in the annotation list immediately after you select an authority entry, so you don't have to click anywhere else.</p>\n    <p class=\"tei-para\"><span class=\"tei-emphasis1\">Batch edits and suggestions</span></p>\n    <p class=\"tei-para\">It is not uncommon that the same person will be mentioned multiple times in a document. To simplify and speed up the editing process, the annotation\n      editor tries to detect possible other occurrences of the currently selected entity throughout the document. A list of potential matches is presented at the \n    bottom of the left sidebar.</p>\n    <p class=\"tei-para\">The list is compiled by traversing the text shown on screen, searching for strings which may indicate the same entity. The actual query depends on the information provided authority used: e.g. if the authority supplies alternative names, those will be added to the searched for strings.</p>\n    <p class=\"tei-para\">Each occurrence will show a checkbox to the left. Checking it will immediately tag the corresponding passage as another instance of the same entity. You can also check all boxes at once by clicking on the icon to the top right above the list.</p>\n    <p class=\"tei-para\">Moving your mouse over an entry will scroll the text to the corresponding occurrence, showing you the match in its context.</p>\n    <p class=\"tei-para\">Existing annotations referencing the same entity will also be shown in the list - with their checkbox checked. Sometimes you may also see \n      an entry with red dots beneath, indicating that this is an existing annotation referencing a different entity, so considered a potential inconsistency to review.\n      For example, if you selected the authority entry for \"Ronald Reagan\", you may see other occurrences of \"Reagan\", which have already been annotated as \"Nancy Reagan\". \n      You will see those occurrences underlined with red dots. You can switch them to \"Ronald Reagan\" by checking their box.</p>\n    <p class=\"tei-para\">Unchecking a box will remove the existing annotation, e.g. incorrectly applied one.</p>\n    <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n        <span class=\"tei--element\">\n          <img src=\"ann-reagan.jpg\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n        </span>\n      </span><figcaption>Inconsistency warning</figcaption></figure>\n    </pb-observable></div></div>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}