{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.40",
    "rootNode": "3.40",
    "id": "web-annotations",
    "odd": "docbook.odd",
    "next": "3.40.17",
    "previous": "3.38.25",
    "nextId": null,
    "previousId": "new-vocabulary-search",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"web-annotations\"><pb-observable data=\"3.40,3.40\" emit=\"transcription\"><h1 class=\"tei-title7 title\">Annotating Documents</h1><p class=\"tei-para\">Since version 7.1.0, TEI Publisher supports annotating TEI documents via a graphic, web\n      based interface. This means you can enhance existing TEI documents directly within TEI\n      Publisher in a user-friendly environment where XML code is neatly hidden from sight when not\n      needed.</p><p class=\"tei-para\">The annotation editor is not meant for creating documents from scratch but targets one of\n      the most tedious and time consuming tasks in any edition project: adding semantic, analytic or\n      text-critical markup to an existing transcription.</p><figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n        <span class=\"tei--element\">\n          <img src=\"ann-overview.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 900px; \">\n        </span>\n      </span><figcaption>Annotation editor</figcaption></figure><p class=\"tei-para\">Typical workflow for many projects will resemble the following:</p><ol class=\"tei-orderedlist\"><li class=\"tei-listitem\">\n        <p class=\"tei-para\">An initial transcription is created, either manually in a text editor, or using OCR or\n          HTR tools like Transkribus. It contains the basic structural markup, i.e. divisions,\n          headings, paragraphs etc.</p>\n      </li><li class=\"tei-listitem\">\n        <p class=\"tei-para\">That initial transcription is gradually enriched: textual features like emphasis can\n          be marked, abbreviations expanded, corrections and regularizations applied; people, places\n          or terms appearing in the text can be explicitly tagged and linked to an authority; dates\n          or measures normalized. This is an iterative process: the resulting TEI encoding is\n          constantly reviewed, which may result in further changes to be made.</p>\n      </li></ol><p class=\"tei-para\">Web annotations try to ease the burden of the enrichment phase by allowing editors to mark\n      everything directly within the user-friendly environment, closely resembling the publication\n      view. It is much easier to read and doesn't require half as much TEI experience as using an\n      XML editor. Just use your mouse to highlight the text fragment to annotate, click on the\n      annotation type and optionally select additional information, e.g. to link with an external\n      authority file.</p></pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}