{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.6.9.15",
    "rootNode": "3.6.9.15",
    "id": "v9",
    "odd": "docbook.odd",
    "next": "3.6.9.16",
    "previous": "3.6.9",
    "nextId": "v8",
    "previousId": "versions",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"v9\"><pb-observable data=\"3.6.9.15,3.6.9.15\" emit=\"transcription\">\n            <h3 class=\"tei-title7 title\">What's new in TEI Publisher 9.0.0</h3>\n            <p class=\"tei-para\">Version 9 has seen a major rework of the annotation facilities and introduced local authority registers for people, places and organizations.\n          There have been small but powerful improvements to facets and numerous minor fixes and extensions, including redesign of the layout templates and ODDs\n          for some of the examples from the Demo Collection.</p>\n        <p class=\"tei-para\">As showcased in the <a href=\"/../test/F-rom.xml\" class=\"tei-link5\" target=\"\">Shakespeare sample</a> and app, TEI Publisher now supports generating <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=presentation-manifests\" xml-id=\"presentation-manifests\" emit=\"transcription\">IIIF presentation manifests</pb-link> and displaying them alongside\n          the text. Text and image view communicate to each other, which means that if you navigate to the next page/image in either of the two, the other\n          reacts accordingly. While there are external tools for creating IIIF manifests, the Shakespeare sample auto-generates them from the TEI header and the\n          page breaks in the document.</p>\n        <p class=\"tei-para\">The URL routing features introduced with version 8 have been substantially improved, introducing <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=client-side-urls\" xml-id=\"client-side-urls\" emit=\"transcription\">configurable URL templates</pb-link> also on the client\n          side. This means you can construct URLs which are really completely independent of the underlying data organisation, while making sure the user always\n          sees the page in a consistent state.</p>\n        <p class=\"tei-para\">Furthermore it became easier to select less frequent <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=facets\" xml-id=\"facets\" emit=\"transcription\">facets</pb-link> when browsing or searching: previously only the most frequent facets where shown by\n          default and you had to browse through a potentially long list if you wanted to find a not so common one. Now you can display a combo box in addition\n          to the list, allowing users to type in a string and see matching facets.</p>\n            <p class=\"tei-para\">This edition has also brought the demise of the <span class=\"tei-code2 code\">teiSimplePrint</span> ODD, previously the source ODD for the <span class=\"tei-code2 code\">teipublisher</span>\n          ODD. Models from the SimplePrint, after thorough review, have been merged into the default TEI Publisher ODD. This is a first step on the road for the\n          extended and rationalized base ODD, a project inspired by the TEI Vanilla meetups of yore and now undertaken by e-editiones in cooperation with the\n          TEI consortium.</p>\n            <p class=\"tei-para\">The new <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=web-annotations\" xml-id=\"web-annotations\" emit=\"transcription\">annotation editor</pb-link> boasts a new, more user friendly and ergonomic layout with additional \n              capacity to add or edit registry entries from within the editor. Furthermore, a function to find potential matches for \n              the current annotation and review them on the spot is the long awaited feature, which promises to speed up the editing process without \n              compromising quality or consistency.</p>\n            <p class=\"tei-para\">A default set up for local registers of places, people and organizations allows editors to curate these resources under the same \n              roof and at the same time as they annotate the sources. As usual, our registers provide a firm base for extensions and customizations.</p>\n            <p class=\"tei-para\">Since the release of the previous version there was a new major version of the <span class=\"tei-code2 code\">tei-publisher-lib</span> and numerous releases of TEI\n          Publisher's <span class=\"tei-code2 code\">webcomponents</span> library.</p>\n            <p class=\"tei-para\">See chapter on <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=updating\" xml-id=\"updating\" emit=\"transcription\">Updating</pb-link> for information how to update\n              your app to the newest version.</p>\n          </pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}