{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.44.9",
    "rootNode": "3.44.9",
    "id": "hosting",
    "odd": "docbook.odd",
    "next": "3.44.11",
    "previous": "3.44.7.14",
    "nextId": null,
    "previousId": null,
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"hosting\"><pb-observable data=\"3.44.9,3.44.9\" emit=\"transcription\">\n      <h2 class=\"tei-title7 title\">Hosting</h2>\n      <p class=\"tei-para\">Where and how to host a custom edition built with TEI Publisher is one of the most frequent questions we\n        receive. Fortunately there are various options and we're doing our best to help academic users by providing\n        various tools to simplify the task, as well as cooperating with providers.</p>\n      <p class=\"tei-para\">Some options are:</p>\n      <dl><dt>dedicated server</dt><dd>\n            <p class=\"tei-para\">means a physical or virtual machine on which eXist-db, TEI Publisher and a proxy server can be\n              installed and configured. Many academic providers and\n              research infrastructures (e.g. Huma-Num) routinely support dedicated eXist-db and TEI Publisher\n              installations while others can do so upon request.</p>\n          </dd><dt>dockerized installation</dt><dd>\n            <p class=\"tei-para\">we provide a ready-to-use configuration including TEI Publisher, a proxy and the named entity\n              recognition service in the <a href=\"https://github.com/eeditiones/teipublisher-docker-compose\" class=\"tei-link4\" target=\"_new\">teipublisher-docker-compose</a> Github repository. The readme describes how to customize this\n              configuration for your own custom edition.</p>\n            <p class=\"tei-para\">To use this option you need to find a hosting provider, which supports running a dockerized\n              architecture with <span class=\"tei-emphasis2\">docker compose</span> (just search for a virtual cloud server with docker\n              preinstalled). Fortunately this is quite common and - unless you intend to\n              run a heavy duty service – the costs are very acceptable. With this option,\n              rebuilding the entire setup is quick and easy, which makes it the perfect solution for sites still being\n              under development. On the downside, performance may not be as good as with a dedicated server, but it is\n              hard to give any reliable figures. You'll have to see yourself. </p>\n          </dd><dt>static site</dt><dd>\n            <p class=\"tei-para\">the newest kid on the block: instead of running TEI Publisher, eXist etc., you can transform your\n              custom edition into a static site. This means that the entire application is converted to a pregenerated\n              set of static HTML pages and helper files. The generated files can be hosted on any web server, including\n              free services like GitHub Pages. It is a particularly fitting solution for smaller editions without extensive\n              search features. The article <a href=\"https://www.e-editiones.org/posts/community-event-going-static/\" class=\"tei-link4\" target=\"_new\">Generating a\n                high voltage site by going static</a> describes how such a static site can be generated\n              and discusses in detail the advantages and drawbacks of this solution.</p>\n          </dd><dt>all-inclusive hosting options</dt><dd>\n            <p class=\"tei-para\">in cooperation with e-editiones, <a href=\"https://www.archives-online.org/\" class=\"tei-link5\" target=\"\">Archives Online</a> provides a complete hosting solution for scholarly\n              editions based on TEI Publisher and IIIF on <a href=\"https://sources-online.org/\" class=\"tei-link4\" target=\"_new\">sources-online.org</a>. This covers long-term maintenance and\n              support of an edition project. If you are interested in having an edition hosted, please contact <a href=\"/info@archives-online.org\" class=\"tei-link5\" target=\"\">Archives Online</a>.</p>\n          </dd></dl>\n    </pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}