{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.12.17.9",
    "rootNode": "3.12.17.9",
    "id": "setting-parameters",
    "odd": "docbook.odd",
    "next": "3.12.17.9.17",
    "previous": "3.12.17.7",
    "nextId": "external-parameters",
    "previousId": "pm-extensions-default",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"setting-parameters\"><pb-observable data=\"3.12.17.9,3.12.17.9\" emit=\"transcription\"><h3 class=\"tei-title7 title\">Setting processing parameters for the ODD</h3><p class=\"tei-para\">Depending on the application context we often wish to differentiate the desired\n          processing output. For example when displaying the list of documents available in an\n          edition we usually only want to see a rather short entry comprising of the author and\n          title, but when viewing an individual document we certainly want to present all associated\n          metadata, not to mention arrange that information visually in a distinct way. </p><p class=\"tei-para\">To this end, we can pass external parameters into the ODD, which inform the processor\n          which of the processing scenarios we wish to follow.</p><p class=\"tei-para\">In a <a href=\"/?odd=docbook.odd&amp;view=div&amp;id=external-parameters\" class=\"tei-link3\" target=\"\">External parameters</a> section you can read more about this, \n          the most common, use case for passing parameters in the ODD.</p><p class=\"tei-para\"> In version 3.0.0 of the <span class=\"tei-code2 code\">tei-publisher-lib</span> we added two carefully chosen\n          features to our implementation of the TEI Processing Model: </p><ul class=\"tei-itemizedlist\"><li class=\"tei-listitem\">\n            <p class=\"tei-para\">a method to specify a processing mode passed to all subsequently called\n              models</p>\n          </li><li class=\"tei-listitem\">\n            <p class=\"tei-para\">a way to set a parameter, so it will be available to subsequently processed\n              models</p>\n          </li></ul><p class=\"tei-para\"> The first is implemented as a specialization of the second. Both features are\n          intended for relatively rare cases, where the standard mechanisms for handling the flow of\n          processing are not enough. This mainly applies to cases in which you have to process the\n          same part of the TEI document multiple times in the same processing context (usually\n            <span class=\"tei-code2 code\">pb-view</span>). None of the examples shipping with TEI Publisher needs these\n          features, but in elaborate editions we do encounter situations which cannot be handled\n          without them. </p></pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}