{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.8.17",
    "rootNode": "3.8.17",
    "id": "upload",
    "odd": "docbook.odd",
    "next": "3.10",
    "previous": "3.8.15",
    "nextId": "supported-input-formats",
    "previousId": "odd-experiments",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"upload\"><pb-observable data=\"3.8.17,3.8.17\" emit=\"transcription\">\n      <h2 class=\"tei-title7 title\">Uploading your own documents</h2>\n      <p class=\"tei-para\"> If you read this, in all likelihood you already have some documents of your own you\n        might want published, whether they are in TEI, DocBook, JATS, MS Word DOCX or other XML format.\n        The first step is to upload them into the database. You need to be <span class=\"tei-emphasis1\">logged in</span> and in the Playground area to do it (check the short info on the\n          <span class=\"tei-guibutton guibutton\"> Start</span> page for user name and password).</p>\n      <p class=\"tei-para\">TEI Publisher installs two default application users:</p>\n      <dl><dt>tei-demo (default password: <span class=\"tei-emphasis2\">demo</span>)</dt><dd>\n            <p class=\"tei-para\">This user can upload to the playground, annotations and jats collections. It can create new ODDs and\n              edit them. However, it cannot recompile ODDs other than the ones it created.</p>\n          </dd><dt>tei (default password: <span class=\"tei-emphasis2\">simple</span></dt><dd>\n            <p class=\"tei-para\">has full access to all collections, can change all ODDs, generate apps etc. On a public server we\n              strongly recommend to change at least this user's password.</p>\n          </dd></dl>\n      <p class=\"tei-para\">Upon successful login, uploading is just a\n        question of dragging your documents onto the <span class=\"tei-guibutton guibutton\">Upload</span> area. They will\n        become available in the document list immediately after upload is completed. </p>\n      <figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n          <span class=\"tei--element\">\n            <img src=\"upload.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 512px; \">\n          </span>\n        </span><figcaption>The Upload Panel</figcaption></figure>\n      <p class=\"tei-para\"> Congratulations, now you can view your documents! Try to experiment and find the ODD\n        and page template that best fits your needs and use it as a starting point for your own\n        customization, if necessary. Once you are ready with these you can <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=create-app\" xml-id=\"create-app\" emit=\"transcription\">generate your own application</pb-link> for your documents only, which\n        packs just what is needed for publishing into a standalone application package. </p>\n      <p class=\"tei-para\"> If you attempt to upload a Microsoft Word document, the upload will automatically\n        trigger upconversion of Word to TEI, using a custom ODD for the tranformation. Please note\n        that the focus of this conversion is to preserve textual content, structure and basic\n        semantics of the text, not provide authoritative mapping of complete set of MS Word features\n        to TEI. Refer to <pb-link class=\"tei-link3\" uri=\"?odd=docbook.odd&amp;view=div&amp;id=docx\" xml-id=\"docx\" emit=\"transcription\">DOCX handling</pb-link> section for more information. </p>\n      <div class=\"tei-note3 note\"><h4 class=\"tei-title4\">Note</h4><p class=\"tei-para\">Please bear in mind that while TEI Publisher aims to be a universal tool, the specific\n          components may make certain assumptions about data they are getting and if your documents\n          do not follow the same conventions it may be required to adjust parameters passed to the\n          components from the page template or the component logic.</p><p class=\"tei-para\"> By means of example - a table of content component assumes that the document\n          structure is represented by means of nested <span class=\"tei-parameter code\">div</span> elements and\n          section titles are given in <span class=\"tei-parameter code\">head</span> element. If your project rather\n          chooses numbered divisions (<span class=\"tei-parameter code\">div1</span>, <span class=\"tei-parameter code\">div2</span>) etc\n          it may be advisable to adjust this to avoid customizing all navigation, table of contents\n          and so on, but it is one of very rare cases where TEI Publisher exposes any predilection\n          for a particular flavour of TEI. </p><p class=\"tei-para\"> Similarly, the template for aligned transcription and translation is parametrized to\n          accept an XPath expression pointing to the location of the transcription and aligned\n          translation. Likely for your documents this expression would have to be adjusted (unless\n          of course you also have Latin texts with Polish translation structured in a similar way).\n          Furthermore, to correctly display corresponding translation fragment a custom mapping\n          function may need to be passed to the translation view (cf. <span class=\"tei-link2\"><pb-edit-xml path=\"/db/apps/tei-publisher/templates/pages/vangogh.html\">\n            <span class=\"tei-filename code\">Van Gogh</span>\n          <iron-icon icon=\"icons:open-in-new\"></iron-icon></pb-edit-xml></span> or <span class=\"tei-link2\"><pb-edit-xml path=\"/db/apps/tei-publisher/templates/pages/cortez.html\">\n            <span class=\"tei-filename code\">Cortés</span>\n          <iron-icon icon=\"icons:open-in-new\"></iron-icon></pb-edit-xml></span> letter templates for examples) </p></div>\n    </pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}