{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.21",
    "rootNode": "3.21",
    "id": "appgen",
    "odd": "docbook.odd",
    "next": "3.21.19",
    "previous": "3.19.19",
    "nextId": "appgen-code-overview",
    "previousId": "i18n-customization",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section3\" id=\"appgen\"><pb-observable data=\"3.21,3.21\" emit=\"transcription\"><h1 class=\"tei-title6 title\">Creating applications with the App Generator</h1><p class=\"tei-para\">Once you are happy with a certain ODD and HTML template customization, you can easily\n        create a complete, standalone application. Such application can be tailored further to fit\n        your needs. The generated app can be downloaded as a portable xar package, to be installed\n        into other eXist instances, or synchronised to disk for further development. It provides a\n        fully functional application scaffolding based on TEI Publisher components and modules,\n        pre-configured to use a certain ODD, page template and other settings.</p><div class=\"tei-note3 note\"><h4 class=\"tei-title4\">Note</h4><p class=\"tei-para\">Early versions of the TEI Publisher included everything they needed to run without TEI\n          Publisher. This had some advantages, but also made it more difficult to update to newer\n          releases.</p><p class=\"tei-para\">\n        Starting with version 5 we are gradually moving towards more lightweight app design,\n          ultimately containing only resources which are truly specific to the app (ODDs, HTML\n          templates, images), while all generic functionality will be provided by TEI Publisher and\n          its libraries and packages. Version 6 has seen all web components extracted into\n        <span class=\"tei-code2 code\">pb-components</span>\n        package and in version 7 the server-side code has been based\n          on a well designed API specification with provisions for easy customization.\n        \n      </p><p class=\"tei-para\">\n        Please make sure you are following our\n        <a href=\"/?odd=docbook.odd&amp;view=div&amp;id=customization-best-practice\" class=\"tei-link3\" target=\"\">best practice recommendations</a>\n        for a smooth upgrade path.\n      </p></div><p class=\"tei-para\">\n      To get started, click on\n      <span class=\"tei--element\">App Generator</span>\n      in the menu bar and\n        fill out the form.\n    </p><p class=\"tei-para\">The following form fields are of particular importance:</p><dl><dt>ODD</dt><dd>\n          <p class=\"tei-para\">Here you select the ODD(s) to be used for transformations. If multiple ODDs are\n              selected, the first one will be the default.</p>\n        </dd><dt>URL to identify the app</dt><dd>\n          <p class=\"tei-para\">This is the main identifier for your app and should be a globally unique URI. It\n              does not need to correspond to any existing web site. eXist's package manager is using\n              this URI as a unique identifier for the app.</p>\n        </dd><dt>Abbreviation</dt><dd>\n          <p class=\"tei-para\">The abbreviation will be used as the name of the root collection of your app and\n              as the last path component in any URL pointing to the app. It should be unique within\n              one database instance.</p>\n        </dd><dt>Template</dt><dd>\n          <p class=\"tei-para\">The HTML template to be used as default for viewing a document. If you created a\n              custom template or modified any of the existing templates, you likely want to select\n              this here.</p>\n        </dd><dt>Data Collection</dt><dd>\n          <p class=\"tei-para\">Only specify something here if you have existing data inside the database or if\n              you want to ship the data set as part of a second, separate app. In all other cases,\n              leave this field empty.</p>\n        </dd><dt>Default View</dt><dd>\n          <p class=\"tei-para\">\n            Default document view - whole document, page by page or division by division. If\n              you would like to choose page by page, set this to\n            <span class=\"tei--element\">\"By\n                Page\"</span>\n            but please note that all your documents must be appropriately\n              encoded with page breaks as\n            <span class=\"tei-tag code\">pb</span>\n            elements. You will still be able to change\n              the view settings in HTML template or users can do it via query parameters.\n          </p>\n        </dd><dt>User/Password</dt><dd>\n          <p class=\"tei-para\">The user account which will own all application files. For security reasons, it is\n              advisable to create a new account for every app.</p>\n        </dd></dl><p class=\"tei-para\">Once you created the new application, log into it using the account details you\n        provided. You can then upload XML documents using the upload panel in the sidebar.</p><figure class=\"tei-figure2 figure\" id=\"create-app\"><span class=\"tei--element\">\n        <span class=\"tei--element\">\n          <img src=\"CreateApp.gif\" class=\"tei-imagedata2\" title=\"\">\n        </span>\n      </span><figcaption>Create an App</figcaption></figure></pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}