{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.44.19",
    "rootNode": "3.44.19",
    "id": "register-maintain",
    "odd": "docbook.odd",
    "next": "3.44.19.17",
    "previous": "3.44",
    "nextId": "register-edit",
    "previousId": "registers",
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"register-maintain\"><pb-observable data=\"3.44.19,3.44.19\" emit=\"transcription\"><h2 class=\"tei-title7 title\">Maintaining authority registers</h2><p class=\"tei-para\">Typically, when annotating the text of the transcription we will consult an authority file, \n      either an external resource like GND or VIAF, or one internal to the project to identify a reference to a place or an individual.\n      On the level of the TEI encoding we will be usually just adding an identifier reference to the dedicated element, like <span class=\"tei-code2 code\">persName</span>.\n    </p><p class=\"tei-para\">As it is a tedious and error prone task to provide these identifiers manually, TEI Publisher offers a \n      mechanism to query authority registers, present matching results and make a selection in a user friendly interactive component\n       (see arrow marked as 1. on the screenshot below). \n      Thanks to its functionality a connection can be made without ever typing or copying long identifiers.</p><pb-code-highlight class=\"tei-programlisting5\" language=\"xml\">... in Altenberg &lt;persName ref=\"gnd-136602592\"&gt;Ambrosius Leibnütz&lt;/persName&gt; ...</pb-code-highlight><p class=\"tei-para\">As a side effect of such an operation, TEI Publisher creates a local register entry for the selected entity.</p><p class=\"tei-para\">Nevertheless, from time to time an entry will not yet exist in the authority register we are using, or possibly the \n      information there is incomplete or incorrect. One could edit the local register manually in such cases, but from \n      TEI Publisher version 9 we now offer facilities to edit or create an entry in \n      the local register (see arrows marked 2 and 3 in the screenshot) through a form-based interface. Just click on the \n      <span class=\"tei-emphasis2\">pencil</span> icon to edit the entry locally (or use <span class=\"tei-emphasis2\">plus sign</span> icon to add a completely new one.</p><figure class=\"tei-figure2 figure\"><span class=\"tei--element\">\n          <span class=\"tei--element\">\n            <img src=\"register-edit.png\" class=\"tei-imagedata2\" title=\"\" style=\"width: 800px; \">\n          </span>\n        </span><figcaption>Accessing register linking and editing functions in annotation editor</figcaption></figure></pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}