{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": "3.38.19",
    "rootNode": "3.38.19",
    "id": null,
    "odd": "docbook.odd",
    "next": "3.38.21",
    "previous": "3.38.17",
    "nextId": null,
    "previousId": null,
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\"><pb-observable data=\"3.38.19,3.38.19\" emit=\"transcription\">\n      <h2 class=\"tei-title7 title\">Annotations: the pen and paper of the digital world</h2>\n      <p class=\"tei-para\">How the annotation editor works is easy to understand if you imagine reviewing a text\n        the old-fashioned way: print it out, then use a marker to highlight certain passages, write\n        corrections over the text with a pen, or scribble notes into the margin. Once back at your\n        computer, all the changes need to be transferred into the TEI. You may then continue with a\n        second round of review by printing out the results again.</p>\n\n      <p class=\"tei-para\">Within our electronic environment, the printout corresponds to the source TEI document\n        and the marks and scribbles are annotations. Until you explicitely merge the annotations\n        into the source TEI, they will be kept separate from the document they apply to. Once\n        merged, a new version of the source TEI document is established and the editing process\n        restarts.</p>\n      <p class=\"tei-para\">Notably, TEI Publisher is able to detect existing markup in the base text when it is\n        loaded. Any markup corresponding to a known annotation type will be recognized and displayed\n        as such, therefore it can be modified. In this sense it is slightly different from working\n        with pen and paper.</p>\n      <p class=\"tei-para\">From the printout example it should be clear that you cannot change the printed text\n        itself (unless you had some magic paper). Accordingly, annotations are not allowed to change\n        the base text, i.e. the text \"printed\" on the screen. If you want to explicitly indicate a\n        correction, you can use the <span class=\"tei-emphasis2\">corr</span> or <span class=\"tei-emphasis2\">reg</span> annotation\n        type, which corresponds to the TEI encoding with choice/sic/corr or choice/orig/reg. </p>\n      <p class=\"tei-para\">You can use annotations for virtually any kind of inline markup. The only strict\n        requirement is that the <span class=\"tei-emphasis2\">base text</span>, our source document, remains stable\n          <span class=\"tei-emphasis2\">during an editing session</span> i.e. until annotations are merged. The\n        reason for that is the annotations are anchored to a certain position in the document, so\n        any changes to it would mean that our coordinates might suddenly point to different\n        fragments.</p>\n      <p class=\"tei-para\">That said, there's also a special <span class=\"tei-emphasis2\">edit</span> annotation type, which does\n        allow you to perform limited editing of a text. It will just \"seamlessly\" change the\n        transcription text fragment without adding any explicit markup. Nevertheless, such a change\n        to the TEI document is only applied when you merge and therefore establish a new base text.\n        The limitation is that only text fragments can be edited: the boundaries of structural\n        markup or annotations may not be crossed. It can be convenient for fixing a typo in a\n        transcription that wasn’t caught when the base text was prepared.</p>\n      <p class=\"tei-para\">You also cannot use the annotation editor to modify the structural markup of the base\n        text, i.e. block-level elements like divs, paragraphs, headings or notes. In case you need\n        to change the structure, you have to merge your annotations first, saving a new version of\n        the TEI document and switch to an XML editor to change the XML there. The new document can\n        be then reloaded into the annotation editor and you can continue.</p>\n      <p class=\"tei-para\">As already indicated, it is possible to handle common nested encoding structures like\n          <span class=\"tei-tag code\"> choice</span> or <span class=\"tei-tag code\">app</span> as annotations. Nevertheless the inner elements, i.e.\n          <span class=\"tei-tag code\">lem</span>, <span class=\"tei-tag code\">rdg</span>, <span class=\"tei-tag code\">sic</span>, <span class=\"tei-tag code\">corr</span> or <span class=\"tei-tag code\">orig</span>,\n          <span class=\"tei-tag code\">reg</span>, need to have simple text content: they cannot be annotated themselves (at\n        least not in the current version).</p>\n    </pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}