{
    "format": "json",
    "view": "div",
    "doc": "documentation.xml",
    "root": null,
    "rootNode": "3.6",
    "id": "introduction",
    "odd": "docbook.odd",
    "next": "3.6.7",
    "previous": null,
    "nextId": "e-editiones",
    "previousId": null,
    "switchView": null,
    "content": "<!DOCTYPE html><html><head></head><body><div class=\"content \"><div class=\"tei-section4\" id=\"introduction\"><pb-observable data=\"3.6,3.6\" emit=\"transcription\">\n    <h1 class=\"tei-title7 title\">Introduction</h1>\n    <div class=\"tei-section4\" id=\"introduction-explainer\"><pb-observable data=\"3.6,3.6.5\" emit=\"transcription\">\n      <h2 class=\"tei-title7 title\">What TEI Publisher does ...</h2>\n      <p class=\"tei-para\"> The motivation behind TEI Publisher was to provide a tool which enables scholars and\n        editors to publish their materials without becoming programmers, but also does not force\n        them into a one-size-fits-all framework. Experienced developers will benefit as well by\n        writing less code, avoiding redundancy, improve maintenance and interoperability - to just\n        name a few. TEI Publisher is all about <span class=\"tei-emphasis1\">standards</span>, <span class=\"tei-emphasis1\">modularity</span>, <span class=\"tei-emphasis1\">reusability</span> and\n          <span class=\"tei-emphasis1\">sustainability</span>! </p>\n      <p class=\"tei-para\">In Publisher, it all starts with your source documents - regardless if they are in TEI\n        or other form of XML: DocBook, MS Word (DOCX) or JATS. No matter how the source material has\n        been encoded, it can be easily transformed into a range of output formats for publication -\n        from a modern web page that you can open on your laptop or mobile device, to an ebook, a PDF\n        file or its LaTeX source.</p>\n      <p class=\"tei-para\"> TEI Publisher derives its name from TEI and the TEI Processing Model (PM). Processing\n        Model is a part of the TEI vocabulary and TEI ODD specification format, described in the\n          <a href=\"http://www.tei-c.org/release/doc/tei-p5-doc/en/html/TD.html#TDPM\" class=\"tei-link4\" target=\"_new\">TEI P5\n          guidelines</a> as well as further chapters here. It defines how a TEI document should\n        be rendered in different output formats and lies at the heart of TEI Publisher. </p>\n      <p class=\"tei-para\">However, online editions require more than just a text transformation: the text needs to\n        be embedded into an application context, adding navigation, pagination, search, facsimile\n        display and so on. The larger part of TEI Publisher deals with those aspects, providing all\n        the necessary building blocks for an online edition.</p>\n      <p class=\"tei-para\"> Staying true to the spirit of code reuse and interoperability, TEI Publisher implements\n        its functionalities as small \"lego\" blocks to be freely arranged and recombined. The\n        technology making this possible is called <span class=\"tei-emphasis2\">Web Components</span>. It is part of\n        the HTML5 specification and natively implemented by many browsers. Users don't need to dive\n        into the details of this standard though: all you need to modify the example pages is some\n        basic HTML knowledge. </p>\n      <p class=\"tei-para\"> Only where the <a href=\"https://cdn.tei-publisher.com/api.html\" class=\"tei-link4\" target=\"_new\">available components</a> are not\n        enough, a new use case needs to be described and suitable new components implemented but\n        then they can be incorporated into existing component pool for everyone else to use. After\n        all, our mantra is reuse, reuse, reuse and we want to turn TEI Publisher into a box of tools\n        the entire community can benefit from. </p>\n      <p class=\"tei-para\">Despite the elegant simplicity of this approach, various projects we realized in the\n        past prove that TEI Publisher is:</p>\n      <ol class=\"tei-orderedlist\"><li class=\"tei-listitem\">\n          <p class=\"tei-para\">powerful enough to cover complex transformation needs</p>\n        </li><li class=\"tei-listitem\">\n          <p class=\"tei-para\">a truly universal tool for any kind of digital edition</p>\n        </li><li class=\"tei-listitem\">\n          <p class=\"tei-para\">capable of generating high quality, camera ready material for book publishing</p>\n        </li><li class=\"tei-listitem\">\n          <p class=\"tei-para\">sustainable and future-proof solution</p>\n        </li><li class=\"tei-listitem\">\n          <p class=\"tei-para\">suitable for any XML, not just TEI (this documentation is written in\n            DocBook!)</p>\n        </li></ol>\n    </pb-observable></div></pb-observable></div></div></body></html>",
    "footnotes": "",
    "userParams": {
        "webcomponents": 7
    },
    "collection": "doc"
}